OpenNuvoton/M55M1BSP/Library/StdDriver/src/crypto.c
/**************************************************************************//**
 * @file     crypto.c
 * @version  V1.00
 * @brief    CRYPTO driver source file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <string.h>
#include <stddef.h>
#include "NuMicro.h"

/** @cond HIDDEN_SYMBOLS */
#if defined(ENABLE_DEBUG)
    #define CRYPTO_DBGMSG   printf
#else
    #define CRYPTO_DBGMSG(...)   do { } while (0)       /* disable debug */
#endif
/** @endcond HIDDEN_SYMBOLS */


/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup CRYPTO_Driver CRYPTO Driver
  @{
*/

#define ECCOP_POINT_MUL     (0x0UL << CRYPTO_ECC_CTL_ECCOP_Pos)
#define ECCOP_MODULE        (0x1UL << CRYPTO_ECC_CTL_ECCOP_Pos)
#define ECCOP_POINT_ADD     (0x2UL << CRYPTO_ECC_CTL_ECCOP_Pos)
#define ECCOP_POINT_DOUBLE  (0x0UL << CRYPTO_ECC_CTL_ECCOP_Pos)

#define MODOP_DIV           (0x0UL << CRYPTO_ECC_CTL_MODOP_Pos)
#define MODOP_MUL           (0x1UL << CRYPTO_ECC_CTL_MODOP_Pos)
#define MODOP_ADD           (0x2UL << CRYPTO_ECC_CTL_MODOP_Pos)
#define MODOP_SUB           (0x3UL << CRYPTO_ECC_CTL_MODOP_Pos)

/** @cond HIDDEN_SYMBOLS */
static uint32_t g_AES_CTL[4];
static ECC_CURVE  *pCurve = (ECC_CURVE *)NULL;

static char get_Nth_nibble_char(uint32_t val32, uint32_t idx);
static char ch2hex(char ch);
static int  get_nibble_value(char c);
static ECC_CURVE *get_curve(E_ECC_CURVE ecc_curve);
static void run_ecc_codec(CRYPTO_T *crypto, uint32_t mode, int enable_scap);
static int32_t ecc_init_curve(CRYPTO_T *crypto, E_ECC_CURVE ecc_curve);

#if defined(ENABLE_DEBUG)
    static void dump_ecc_reg(char *str, uint32_t volatile regs[], int32_t count);
#endif
/** @endcond HIDDEN_SYMBOLS */



/** @addtogroup CRYPTO_EXPORTED_FUNCTIONS CRYPTO Exported Functions
  @{
*/
/**
  * @brief  Open PRNG function
  * @param[in]  crypto   Reference to Crypto module.
  * @param[in]  u32KeySize is PRNG key size, including:
  *         - \ref PRNG_KEY_SIZE_128
  *         - \ref PRNG_KEY_SIZE_163
  *         - \ref PRNG_KEY_SIZE_192
  *         - \ref PRNG_KEY_SIZE_224
  *         - \ref PRNG_KEY_SIZE_233
  *         - \ref PRNG_KEY_SIZE_255
  *         - \ref PRNG_KEY_SIZE_256
  *         - \ref PRNG_KEY_SIZE_283
  *         - \ref PRNG_KEY_SIZE_384
  *         - \ref PRNG_KEY_SIZE_409
  *         - \ref PRNG_KEY_SIZE_512
  *         - \ref PRNG_KEY_SIZE_521
  *         - \ref PRNG_KEY_SIZE_571
  * @param[in]  u32SeedReload is PRNG seed reload or not, including:
  *         - \ref PRNG_SEED_CONT
  *         - \ref PRNG_SEED_RELOAD
  * @param[in]  u32Seed  The new seed. Only valid when u32SeedReload is PRNG_SEED_RELOAD.
  * @return None
  */
void PRNG_Open(CRYPTO_T *crypto, uint32_t u32KeySize, uint32_t u32SeedReload, uint32_t u32Seed)
{
    if (u32SeedReload)
    {
        crypto->PRNG_SEED = u32Seed;
    }

    crypto->PRNG_CTL = (u32KeySize << CRYPTO_PRNG_CTL_KEYSZ_Pos) |
                       (u32SeedReload << CRYPTO_PRNG_CTL_SEEDRLD_Pos);
}

/**
  * @brief  Start to generate one PRNG key.
  * @param[in]  crypto   Reference to Crypto module.
  * @return None
  */
void PRNG_Start(CRYPTO_T *crypto)
{
    crypto->PRNG_CTL |= CRYPTO_PRNG_CTL_START_Msk;
}

/**
  * @brief  Read the PRNG key.
  * @param[in]   crypto        Reference to Crypto module.
  * @param[out]  u32RandKey  The key buffer to store newly generated PRNG key.
  * @return None
  */
void PRNG_Read(CRYPTO_T *crypto, uint32_t u32RandKey[])
{
    uint32_t  i;
    uint32_t  wcnt;

    wcnt = (((crypto->PRNG_CTL & CRYPTO_PRNG_CTL_KEYSZ_Msk) >> CRYPTO_PRNG_CTL_KEYSZ_Pos) + 1U) * 2U;

    for (i = 0U; i < wcnt; i++)
    {
        u32RandKey[i] = crypto->PRNG_KEY[i];
    }

    crypto->PRNG_CTL &= ~CRYPTO_PRNG_CTL_SEEDRLD_Msk;
}

/**
  * @brief  Open AES encrypt/decrypt function.
  * @param[in]  crypto         Reference to Crypto module.
  * @param[in]  u32Channel   AES channel. Must be 0~3.
  * @param[in]  u32EncDec    1: AES encode;  0: AES decode
  * @param[in]  u32OpMode    AES operation mode, including:
  *         - \ref AES_MODE_ECB
  *         - \ref AES_MODE_CBC
  *         - \ref AES_MODE_CFB
  *         - \ref AES_MODE_OFB
  *         - \ref AES_MODE_CTR
  *         - \ref AES_MODE_CBC_CS1
  *         - \ref AES_MODE_CBC_CS2
  *         - \ref AES_MODE_CBC_CS3
  * @param[in]  u32KeySize is AES key size, including:
  *         - \ref AES_KEY_SIZE_128
  *         - \ref AES_KEY_SIZE_192
  *         - \ref AES_KEY_SIZE_256
  * @param[in]  u32SwapType is AES input/output data swap control, including:
  *         - \ref AES_NO_SWAP
  *         - \ref AES_OUT_SWAP
  *         - \ref AES_IN_SWAP
  *         - \ref AES_IN_OUT_SWAP
  * @return None
  */
void AES_Open(CRYPTO_T *crypto, uint32_t u32Channel, uint32_t u32EncDec,
              uint32_t u32OpMode, uint32_t u32KeySize, uint32_t u32SwapType)
{
    crypto->AES_CTL =  // (u32Channel << CRYPTO_AES_CTL_CHANNEL_Pos) |
        (u32EncDec << CRYPTO_AES_CTL_ENCRYPTO_Pos) |
        (u32OpMode << CRYPTO_AES_CTL_OPMODE_Pos) |
        (u32KeySize << CRYPTO_AES_CTL_KEYSZ_Pos) |
        (u32SwapType << CRYPTO_AES_CTL_OUTSWAP_Pos);
    g_AES_CTL[u32Channel] = crypto->AES_CTL;
}

/**
  * @brief  Start AES encrypt/decrypt
  * @param[in]  crypto        Reference to Crypto module.
  * @param[in]  u32Channel  AES channel. Must be 0~3.
  * @param[in]  u32DMAMode  AES DMA control, including:
  *         - \ref CRYPTO_DMA_ONE_SHOT   One shop AES encrypt/decrypt.
  *         - \ref CRYPTO_DMA_CONTINUE   Continuous AES encrypt/decrypt.
  *         - \ref CRYPTO_DMA_LAST       Last AES encrypt/decrypt of a series of AES_Start.
  * @return None
  */
void AES_Start(CRYPTO_T *crypto, uint32_t u32Channel, uint32_t u32DMAMode)
{
    crypto->AES_CTL = g_AES_CTL[u32Channel];
    crypto->AES_CTL |= CRYPTO_AES_CTL_START_Msk | (u32DMAMode << CRYPTO_AES_CTL_DMALAST_Pos);
}

/**
  * @brief  Start AES encrypt/decrypt
  * @param[in]  crypto        Reference to Crypto module.
  * @param[in]  u32Channel  AES channel. Must be 0~3.
  * @param[in]  u32DMAMode  AES DMA control, including:
  *         - \ref CRYPTO_DMA_ONE_SHOT   One shop AES encrypt/decrypt.
  *         - \ref CRYPTO_DMA_CONTINUE   Continuous AES encrypt/decrypt.
  *         - \ref CRYPTO_DMA_LAST       Last AES encrypt/decrypt of a series of AES_Start.
  * @param[in]  ksel        0:           AES key is from Key Store SRAM
  *                         2:           AES key is from Key Store OTP
  * @param[in]  knum        Use Key Store OTP/SRAM key number "knum" as AES key
  * @return None
  */
void AES_Start_KS(CRYPTO_T *crypto, uint32_t u32Channel, uint32_t u32DMAMode, int ksel, int knum)
{
    if (ksel == 0)
    {
        crypto->AES_KSCTL = CRYPTO_AES_KSCTL_RSRC_Msk | (uint32_t)knum;     /* from KS SRAM */
    }
    else
    {
        crypto->AES_KSCTL = (2UL << CRYPTO_AES_KSCTL_RSSRC_Pos) | CRYPTO_AES_KSCTL_RSRC_Msk | (uint32_t)knum; /* from KS OTP */
    }

    crypto->AES_CTL = g_AES_CTL[u32Channel];
    crypto->AES_CTL |= CRYPTO_AES_CTL_START_Msk | (u32DMAMode << CRYPTO_AES_CTL_DMALAST_Pos);
}

/**
  * @brief  Set AES keys
  * @param[in]  crypto      Reference to Crypto module.
  * @param[in]  u32Channel  AES channel. Must be 0~3.
  * @param[in]  au32Keys    An word array contains AES keys.
  * @param[in]  u32KeySize is AES key size, including:
  *         - \ref AES_KEY_SIZE_128
  *         - \ref AES_KEY_SIZE_192
  *         - \ref AES_KEY_SIZE_256
  * @return None
  */
void AES_SetKey(CRYPTO_T *crypto, uint32_t u32Channel, const uint32_t au32Keys[], uint32_t u32KeySize)
{
    uint32_t  i;
    uintptr_t reg_addr;
    uint32_t  wcnt;

    reg_addr = (uintptr_t)&crypto->AES_KEY[0] + ((uintptr_t)u32Channel * 0x3CUL);
    wcnt = 4UL + (u32KeySize * 2UL);

    for (i = 0U; i < wcnt; i++)
    {
        outpw(reg_addr, au32Keys[i]);
        reg_addr += sizeof(uint32_t);
    }
}




/**
  * @brief  Set AES keys index of Key Store
  * @param[in]  crypto        The pointer of CRYPTO module
  * @param[in]  mem         Memory type of Key Store key. it could be:
  *                              - \ref KS_SRAM
  *                              - \ref KS_FLASH
  *                              - \ref KS_OTP
  * @param[in]  i32KeyIdx   Index of the key in Key Store.
  * @details    AES could use the key in Key Store. This function is used to set the key index of Key Store.
  */
void AES_SetKey_KS(CRYPTO_T *crypto, KS_MEM_Type mem, int32_t i32KeyIdx)
{
    /* Use key in key store */
    crypto->AES_KSCTL = CRYPTO_AES_KSCTL_RSRC_Msk /* use KS */  |
                        ((uint32_t)mem << CRYPTO_AES_KSCTL_RSSRC_Pos) /* KS Memory type */ |
                        (uint32_t)i32KeyIdx /* key num */ ;

