OpenNuvoton/M55M1BSP/Library/StdDriver/src/crypto.c
}

/**
  * @brief  Set AES initial vectors
  * @param[in]  crypto        Reference to Crypto module.
  * @param[in]  u32Channel    AES channel. Must be 0~3.
  * @param[in]  au32IV        A four entry word array contains AES initial vectors.
  * @return None
  */
void AES_SetInitVect(CRYPTO_T *crypto, uint32_t u32Channel, const uint32_t au32IV[])
{
    uint32_t  i;
    uintptr_t reg_addr;

    reg_addr = (uintptr_t)&crypto->AES_IV[0] + ((uintptr_t)u32Channel * 0x3CUL);

    for (i = 0U; i < 4U; i++)
    {
        outpw(reg_addr, au32IV[i]);
        reg_addr += sizeof(uint32_t);
    }
}

/**
  * @brief  Set AES DMA transfer configuration.
  * @param[in]  crypto       Reference to Crypto module.
  * @param[in]  u32Channel   AES channel. Must be 0~3.
  * @param[in]  u32SrcAddr   AES DMA source address
  * @param[in]  u32DstAddr   AES DMA destination address
  * @param[in]  u32TransCnt  AES DMA transfer byte count
  * @return None
  */
void AES_SetDMATransfer(CRYPTO_T *crypto, uint32_t u32Channel, uint32_t u32SrcAddr,
                        uint32_t u32DstAddr, uint32_t u32TransCnt)
{
    uintptr_t reg_addr;

    reg_addr = (uintptr_t)&crypto->AES_SADDR + ((uintptr_t)u32Channel * 0x3CUL);
    outpw(reg_addr, u32SrcAddr);

    reg_addr = (uintptr_t)&crypto->AES_DADDR + ((uintptr_t)u32Channel * 0x3CUL);
    outpw(reg_addr, u32DstAddr);

    reg_addr = (uintptr_t)&crypto->AES_CNT + ((uintptr_t)u32Channel * 0x3CUL);
    outpw(reg_addr, u32TransCnt);
}


/**
  * @brief  Open SHA encrypt function.
  * @param[in]  crypto      Reference to Crypto module.
  * @param[in]  u32OpMode   SHA operation mode, including:
  *         - \ref SHA_MODE_SHA1
  *         - \ref SHA_MODE_SHA224
  *         - \ref SHA_MODE_SHA256
  *         - \ref SHA_MODE_SHA384
  *         - \ref SHA_MODE_SHA512
  * @param[in]  u32SwapType is SHA input/output data swap control, including:
  *         - \ref SHA_NO_SWAP
  *         - \ref SHA_OUT_SWAP
  *         - \ref SHA_IN_SWAP
  *         - \ref SHA_IN_OUT_SWAP
  * @param[in]  hmac_key_len   HMAC key byte count
  * @return None
  */
void SHA_Open(CRYPTO_T *crypto, uint32_t u32OpMode, uint32_t u32SwapType, uint32_t hmac_key_len)
{
    crypto->HMAC_CTL = (u32OpMode << CRYPTO_HMAC_CTL_OPMODE_Pos) |
                       (u32SwapType << CRYPTO_HMAC_CTL_OUTSWAP_Pos);

    if (hmac_key_len != 0UL)
    {
        crypto->HMAC_KEYCNT = hmac_key_len;
        crypto->HMAC_CTL |= CRYPTO_HMAC_CTL_HMACEN_Msk;
    }
}

/**
  * @brief  Start SHA encrypt
  * @param[in]  crypto        Reference to Crypto module.
  * @param[in]  u32DMAMode    TDES DMA control, including:
  *         - \ref CRYPTO_DMA_ONE_SHOT   One shop SHA encrypt.
  *         - \ref CRYPTO_DMA_CONTINUE   Continuous SHA encrypt.
  *         - \ref CRYPTO_DMA_LAST       Last SHA encrypt of a series of SHA_Start.
  * @return None
  */
void SHA_Start(CRYPTO_T *crypto, uint32_t u32DMAMode)
{
    crypto->HMAC_CTL &= ~(0x7UL << CRYPTO_HMAC_CTL_DMALAST_Pos);
    crypto->HMAC_CTL |= CRYPTO_HMAC_CTL_START_Msk | (u32DMAMode << CRYPTO_HMAC_CTL_DMALAST_Pos);
}

/**
  * @brief  Set SHA DMA transfer
  * @param[in]  crypto       Reference to Crypto module.
  * @param[in]  u32SrcAddr   SHA DMA source address
  * @param[in]  u32TransCnt  SHA DMA transfer byte count
  * @return None
  */
void SHA_SetDMATransfer(CRYPTO_T *crypto, uint32_t u32SrcAddr, uint32_t u32TransCnt)
{
    crypto->HMAC_SADDR = u32SrcAddr;
    crypto->HMAC_DMACNT = u32TransCnt;
}

/**
  * @brief  Read the SHA digest.
  * @param[in]  crypto      Reference to Crypto module.
  * @param[out]  u32Digest  The SHA encrypt output digest.
  * @return None
  */
void SHA_Read(CRYPTO_T *crypto, uint32_t u32Digest[])
{
    uint32_t  i;
    uint32_t  wcnt;
    uint32_t  reg_addr;

    i = (crypto->HMAC_CTL & CRYPTO_HMAC_CTL_OPMODE_Msk) >> CRYPTO_HMAC_CTL_OPMODE_Pos;

    if (i == SHA_MODE_SHA1)
    {
        wcnt = 5UL;
    }
    else if (i == SHA_MODE_SHA224)
    {
        wcnt = 7UL;
    }
    else if (i == SHA_MODE_SHA256)
    {
        wcnt = 8UL;
    }
    else if (i == SHA_MODE_SHA384)
    {
        wcnt = 12UL;
    }
    else
    {
        /* SHA_MODE_SHA512 */
        wcnt = 16UL;
    }

    reg_addr = (uint32_t) & (crypto->HMAC_DGST[0]);

    for (i = 0UL; i < wcnt; i++)
    {
        u32Digest[i] = inpw(reg_addr);
        reg_addr += 4UL;
    }
}

/** @cond HIDDEN_SYMBOLS */




/*-----------------------------------------------------*/
/*  Define elliptic curve (EC):                        */
/*-----------------------------------------------------*/
#define CURVE_DATA_P192 \
    {\
        /* NIST: Curve P-192 : y^2=x^3-ax+b (mod p) */                                                                       \
        CURVE_P_192,                                                                                                         \
        48,     /* Echar */                                                                                                  \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFEFFFFFFFFFFFFFFFC",   /* "000000000000000000000000000000000000000000000003" */        \
        "64210519e59c80e70fa7e9ab72243049feb8deecc146b9b1",                                                                  \
        "188da80eb03090f67cbf20eb43a18800f4ff0afd82ff1012",                                                                  \
        "07192b95ffc8da78631011ed6b24cdd573f977a11e794811",                                                                  \
        58,     /* Epl */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFEFFFFFFFFFFFFFFFF",   /* "6277101735386680763835789423207666416083908700390324961279" */ \
        58,     /* Eol */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFF99DEF836146BC9B1B4D22831",   /* "6277101735386680763835789423176059013767194773182842284081" */ \
        192,    /* key_len */                                                                                                \
        7,                                                                                                                   \
        2,                                                                                                                   \
        1,                                                                                                                   \
        CURVE_GF_P                                                                                                           \
    }

#define CURVE_DATA_P224 \
    {\
        /* NIST: Curve P-224 : y^2=x^3-ax+b (mod p) */                                                                       \
        CURVE_P_224,                                                                                                         \
        56,     /* Echar */                                                                                                  \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFEFFFFFFFFFFFFFFFFFFFFFFFE",  /* "00000000000000000000000000000000000000000000000000000003" */ \
        "b4050a850c04b3abf54132565044b0b7d7bfd8ba270b39432355ffb4",                                                          \
        "b70e0cbd6bb4bf7f321390b94a03c1d356c21122343280d6115c1d21",                                                          \
        "bd376388b5f723fb4c22dfe6cd4375a05a07476444d5819985007e34",                                                          \
        70,     /* Epl */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF000000000000000000000001",  /* "0026959946667150639794667015087019630673557916260026308143510066298881" */ \
        70,     /* Eol */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFF16A2E0B8F03E13DD29455C5C2A3D",  /* "0026959946667150639794667015087019625940457807714424391721682722368061" */ \
        224,    /* key_len */                                                                                                \
        9,                                                                                                                   \
        8,                                                                                                                   \
        3,                                                                                                                   \
        CURVE_GF_P                                                                                                           \
    }

