OpenNuvoton/M55M1BSP/Library/StdDriver/src/crypto.c
#define CURVE_DATA_P256 \
    {\
        /* NIST: Curve P-256 : y^2=x^3-ax+b (mod p) */                                                                       \
        CURVE_P_256,                                                                                                         \
        64,     /* Echar */                                                                                                  \
        "FFFFFFFF00000001000000000000000000000000FFFFFFFFFFFFFFFFFFFFFFFC",  /* "0000000000000000000000000000000000000000000000000000000000000003" */ \
        "5ac635d8aa3a93e7b3ebbd55769886bc651d06b0cc53b0f63bce3c3e27d2604b",                                                  \
        "6b17d1f2e12c4247f8bce6e563a440f277037d812deb33a0f4a13945d898c296",                                                  \
        "4fe342e2fe1a7f9b8ee7eb4a7c0f9e162bce33576b315ececbb6406837bf51f5",                                                  \
        78,     /* Epl */                                                                                                    \
        "FFFFFFFF00000001000000000000000000000000FFFFFFFFFFFFFFFFFFFFFFFF",  /* "115792089210356248762697446949407573530086143415290314195533631308867097853951" */ \
        78,     /* Eol */                                                                                                    \
        "FFFFFFFF00000000FFFFFFFFFFFFFFFFBCE6FAADA7179E84F3B9CAC2FC632551",  /* "115792089210356248762697446949407573529996955224135760342422259061068512044369" */ \
        256,    /* key_len */                                                                                                \
        10,                                                                                                                  \
        5,                                                                                                                   \
        2,                                                                                                                   \
        CURVE_GF_P                                                                                                           \
    }

#define CURVE_DATA_P384 \
    {\
        /* NIST: Curve P-384 : y^2=x^3-ax+b (mod p) */                                                                       \
        CURVE_P_384,                                                                                                         \
        96,     /* Echar */                                                                                                  \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFEFFFFFFFF0000000000000000FFFFFFFC",  /* "000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000003" */ \
        "b3312fa7e23ee7e4988e056be3f82d19181d9c6efe8141120314088f5013875ac656398d8a2ed19d2a85c8edd3ec2aef",                  \
        "aa87ca22be8b05378eb1c71ef320ad746e1d3b628ba79b9859f741e082542a385502f25dbf55296c3a545e3872760ab7",                  \
        "3617de4a96262c6f5d9e98bf9292dc29f8f41dbd289a147ce9da3113b5f0b8c00a60b1ce1d7e819d7a431d7c90ea0e5f",                  \
        116,    /* Epl */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFEFFFFFFFF0000000000000000FFFFFFFF",  /* "39402006196394479212279040100143613805079739270465446667948293404245721771496870329047266088258938001861606973112319" */ \
        116,    /* Eol */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFC7634D81F4372DDF581A0DB248B0A77AECEC196ACCC52973",  /* "39402006196394479212279040100143613805079739270465446667946905279627659399113263569398956308152294913554433653942643" */ \
        384,    /* key_len */                                                                                                \
        12,                                                                                                                  \
        3,                                                                                                                   \
        2,                                                                                                                   \
        CURVE_GF_P                                                                                                           \
    }

#define CURVE_DATA_P521 \
    {\
        /* NIST: Curve P-521 : y^2=x^3-ax+b (mod p)*/                                                                        \
        CURVE_P_521,                                                                                                         \
        131,    /* Echar */                                                                                                  \
        "1FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFC",  /* "00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000003" */ \
        "051953eb9618e1c9a1f929a21a0b68540eea2da725b99b315f3b8b489918ef109e156193951ec7e937b1652c0bd3bb1bf073573df883d2c34f1ef451fd46b503f00", \
        "0c6858e06b70404e9cd9e3ecb662395b4429c648139053fb521f828af606b4d3dbaa14b5e77efe75928fe1dc127a2ffa8de3348b3c1856a429bf97e7e31c2e5bd66", \
        "11839296a789a3bc0045c8a5fb42c7d1bd998f54449579b446817afbd17273e662c97ee72995ef42640c550b9013fad0761353c7086a272c24088be94769fd16650", \
        157,    /* Epl */                                                                                                    \
        "1FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF",  /* "6864797660130609714981900799081393217269435300143305409394463459185543183397656052122559640661454554977296311391480858037121987999716643812574028291115057151" */ \
        157,    /* Eol */                                                                                                    \
        "1FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFA51868783BF2F966B7FCC0148F709A5D03BB5C9B8899C47AEBB6FB71E91386409",  /* "6864797660130609714981900799081393217269435300143305409394463459185543183397655394245057746333217197532963996371363321113864768612440380340372808892707005449" */ \
        521,    /* key_len */                                                                                                \
        32,                                                                                                                  \
        32,                                                                                                                  \
        32,                                                                                                                  \
        CURVE_GF_P                                                                                                           \
    }

#define CURVE_DATA_B163 \
    {\
        /* NIST: Curve B-163 : y^2+xy=x^3+ax^2+b */                                                                          \
        CURVE_B_163,                                                                                                         \
        41,     /* Echar */                                                                                                  \
        "00000000000000000000000000000000000000001",                                                                         \
        "20a601907b8c953ca1481eb10512f78744a3205fd",                                                                         \
        "3f0eba16286a2d57ea0991168d4994637e8343e36",                                                                         \
        "0d51fbc6c71a0094fa2cdd545b11c5c0c797324f1",                                                                         \
        68,     /* Epl */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF000000000000000000000001",  /* "26959946667150639794667015087019630673557916260026308143510066298881" */ \
        49,     /* Eol */                                                                                                    \
        "40000000000000000000292FE77E70C12A4234C33",   /* "5846006549323611672814742442876390689256843201587" */              \
        163,    /* key_len */                                                                                                \
        7,                                                                                                                   \
        6,                                                                                                                   \
        3,                                                                                                                   \
        CURVE_GF_2M                                                                                                          \
    }

#define CURVE_DATA_B233 \
    {\
        /* NIST: Curve B-233 : y^2+xy=x^3+ax^2+b */                                                                          \
        CURVE_B_233,                                                                                                         \
        59,     /* Echar 59 */                                                                                               \
        "00000000000000000000000000000000000000000000000000000000001",                                                       \
        "066647ede6c332c7f8c0923bb58213b333b20e9ce4281fe115f7d8f90ad",                                                       \
        "0fac9dfcbac8313bb2139f1bb755fef65bc391f8b36f8f8eb7371fd558b",                                                       \
        "1006a08a41903350678e58528bebf8a0beff867a7ca36716f7e01f81052",                                                       \
        68,     /* Epl */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF000000000000000000000001",  /* "26959946667150639794667015087019630673557916260026308143510066298881" */ \
        70,     /* Eol */                                                                                                    \
        "1000000000000000000000000000013E974E72F8A6922031D2603CFE0D7",  /* "6901746346790563787434755862277025555839812737345013555379383634485463" */ \
        233,    /* key_len */                                                                                                \
        74,                                                                                                                  \
        74,                                                                                                                  \
        74,                                                                                                                  \
        CURVE_GF_2M                                                                                                          \
    }

#define CURVE_DATA_B283 \
    {\
        /* NIST: Curve B-283 : y^2+xy=x^3+ax^2+b */                                                                          \
        CURVE_B_283,                                                                                                         \
        71,     /* Echar */                                                                                                  \
        "00000000000000000000000000000000000000000000000000000000000000000000001",                                           \
        "27b680ac8b8596da5a4af8a19a0303fca97fd7645309fa2a581485af6263e313b79a2f5",                                           \
        "5f939258db7dd90e1934f8c70b0dfec2eed25b8557eac9c80e2e198f8cdbecd86b12053",                                           \
        "3676854fe24141cb98fe6d4b20d02b4516ff702350eddb0826779c813f0df45be8112f4",                                           \
        68,     /* Epl */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF000000000000000000000001",  /* "26959946667150639794667015087019630673557916260026308143510066298881" */ \
        85,     /* Eol */                                                                                                    \
        "3FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFEF90399660FC938A90165B042A7CEFADB307",  /* "7770675568902916283677847627294075626569625924376904889109196526770044277787378692871" */ \
        283,    /* key_len */                                                                                                \
        12,                                                                                                                  \
        7,                                                                                                                   \
        5,                                                                                                                   \
        CURVE_GF_2M                                                                                                          \
    }

#define CURVE_DATA_B409 \
    {\
        /* NIST: Curve B-409 : y^2+xy=x^3+ax^2+b */                                                                          \
        CURVE_B_409,                                                                                                         \
        103,    /* Echar */                                                                                                  \
        "0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001",           \
        "021a5c2c8ee9feb5c4b9a753b7b476b7fd6422ef1f3dd674761fa99d6ac27c8a9a197b272822f6cd57a55aa4f50ae317b13545f",           \
        "15d4860d088ddb3496b0c6064756260441cde4af1771d4db01ffe5b34e59703dc255a868a1180515603aeab60794e54bb7996a7",           \
        "061b1cfab6be5f32bbfa78324ed106a7636b9c5a7bd198d0158aa4f5488d08f38514f1fdf4b4f40d2181b3681c364ba0273c706",           \
        68,     /* Epl */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF000000000000000000000001",  /* "26959946667150639794667015087019630673557916260026308143510066298881" */ \
        123,    /* Eol */                                                                                                    \
        "10000000000000000000000000000000000000000000000000001E2AAD6A612F33307BE5FA47C3C9E052F838164CD37D9A21173",  /* "661055968790248598951915308032771039828404682964281219284648798304157774827374805208143723762179110965979867288366567526771" */ \
        409,    /* key_len */                                                                                                \
        87,                                                                                                                  \
        87,                                                                                                                  \
        87,                                                                                                                  \
        CURVE_GF_2M                                                                                                          \
    }

#define CURVE_DATA_B571 \
    {\
        /* NIST: Curve B-571 : y^2+xy=x^3+ax^2+b */                                                                          \
        CURVE_B_571,                                                                                                         \
        143,    /* Echar */                                                                                                  \
        "00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001", \
        "2f40e7e2221f295de297117b7f3d62f5c6a97ffcb8ceff1cd6ba8ce4a9a18ad84ffabbd8efa59332be7ad6756a66e294afd185a78ff12aa520e4de739baca0c7ffeff7f2955727a", \
        "303001d34b856296c16c0d40d3cd7750a93d1d2955fa80aa5f40fc8db7b2abdbde53950f4c0d293cdd711a35b67fb1499ae60038614f1394abfa3b4c850d927e1e7769c8eec2d19", \
        "37bf27342da639b6dccfffeb73d69d78c6c27a6009cbbca1980f8533921e8a684423e43bab08a576291af8f461bb2a8b3531d2f0485c19b16e2f1516e23dd3c1a4827af1b8ac15b", \
        68,     /* Epl */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF000000000000000000000001",  /* "26959946667150639794667015087019630673557916260026308143510066298881" */ \
        172,    /* Eol */                                                                                                    \
        "3FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFE661CE18FF55987308059B186823851EC7DD9CA1161DE93D5174D66E8382E9BB2FE84E47",  /* "3864537523017258344695351890931987344298927329706434998657235251451519142289560424536143999389415773083133881121926944486246872462816813070234528288303332411393191105285703" */ \
        571,    /* key_len */                                                                                                \
        10,                                                                                                                  \
        5,                                                                                                                   \
        2,                                                                                                                   \
        CURVE_GF_2M                                                                                                          \
    }

#define CURVE_DATA_K163 \
    {\
        /* NIST: Curve K-163 : y^2+xy=x^3+ax^2+b */                                                                          \
        CURVE_K_163,                                                                                                         \
        41,     /* Echar */                                                                                                  \
        "00000000000000000000000000000000000000001",                                                                         \
        "00000000000000000000000000000000000000001",                                                                         \
        "2fe13c0537bbc11acaa07d793de4e6d5e5c94eee8",                                                                         \
        "289070fb05d38ff58321f2e800536d538ccdaa3d9",                                                                         \
        68,     /* Epl */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF000000000000000000000001",  /* "26959946667150639794667015087019630673557916260026308143510066298881" */ \
        49,     /* Eol */                                                                                                    \
        "4000000000000000000020108A2E0CC0D99F8A5EF",  /* "5846006549323611672814741753598448348329118574063" */               \
        163,    /* key_len */                                                                                                \
        7,                                                                                                                   \
        6,                                                                                                                   \
        3,                                                                                                                   \
        CURVE_GF_2M                                                                                                          \
    }

#define CURVE_DATA_K233 \
    {\
        /* NIST: Curve K-233 : y^2+xy=x^3+ax^2+b */                                                                          \
        CURVE_K_233,                                                                                                         \
        59,     /* Echar 59 */                                                                                               \
        "00000000000000000000000000000000000000000000000000000000000",                                                       \
        "00000000000000000000000000000000000000000000000000000000001",                                                       \
        "17232ba853a7e731af129f22ff4149563a419c26bf50a4c9d6eefad6126",                                                       \
        "1db537dece819b7f70f555a67c427a8cd9bf18aeb9b56e0c11056fae6a3",                                                       \
        68,     /* Epl */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF000000000000000000000001",    /* "26959946667150639794667015087019630673557916260026308143510066298881" */ \
        70,     /* Eol */                                                                                                    \
        "8000000000000000000000000000069D5BB915BCD46EFB1AD5F173ABDF",  /* "3450873173395281893717377931138512760570940988862252126328087024741343" */ \
        233,    /* key_len */                                                                                                \
        74,                                                                                                                  \
        74,                                                                                                                  \
        74,                                                                                                                  \
        CURVE_GF_2M                                                                                                          \
    }

