OpenNuvoton/M55M1BSP/Library/StdDriver/src/crypto.c
#define CURVE_DATA_K283 \
    {\
        /* NIST: Curve K-283 : y^2+xy=x^3+ax^2+b */                                                                          \
        CURVE_K_283,                                                                                                         \
        71,     /* Echar */                                                                                                  \
        "00000000000000000000000000000000000000000000000000000000000000000000000",                                           \
        "00000000000000000000000000000000000000000000000000000000000000000000001",                                           \
        "503213f78ca44883f1a3b8162f188e553cd265f23c1567a16876913b0c2ac2458492836",                                           \
        "1ccda380f1c9e318d90f95d07e5426fe87e45c0e8184698e45962364e34116177dd2259",                                           \
        68,     /* Epl */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF000000000000000000000001",  /* "26959946667150639794667015087019630673557916260026308143510066298881" */ \
        85,     /* Eol */                                                                                                    \
        "1FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFE9AE2ED07577265DFF7F94451E061E163C61",  /* "3885337784451458141838923813647037813284811733793061324295874997529815829704422603873" */ \
        283,    /* key_len */                                                                                                \
        12,                                                                                                                  \
        7,                                                                                                                   \
        5,                                                                                                                   \
        CURVE_GF_2M                                                                                                          \
    }

#define CURVE_DATA_K409 \
    {\
        /* NIST: Curve K-409 : y^2+xy=x^3+ax^2+b */                                                                          \
        CURVE_K_409,                                                                                                         \
        103,    /* Echar */                                                                                                  \
        "0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",           \
        "0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001",           \
        "060f05f658f49c1ad3ab1890f7184210efd0987e307c84c27accfb8f9f67cc2c460189eb5aaaa62ee222eb1b35540cfe9023746",           \
        "1e369050b7c4e42acba1dacbf04299c3460782f918ea427e6325165e9ea10e3da5f6c42e9c55215aa9ca27a5863ec48d8e0286b",           \
        68,     /* Epl */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF000000000000000000000001",  /* "26959946667150639794667015087019630673557916260026308143510066298881" */ \
        123,    /* Eol */                                                                                                    \
        "7FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFE5F83B2D4EA20400EC4557D5ED3E3E7CA5B4B5C83B8E01E5FCF",  /* "330527984395124299475957654016385519914202341482140609642324395022880711289249191050673258457777458014096366590617731358671" */ \
        409,    /* key_len */                                                                                                \
        87,                                                                                                                  \
        87,                                                                                                                  \
        87,                                                                                                                  \
        CURVE_GF_2M                                                                                                          \
    }

#define CURVE_DATA_K571 \
    {\
        /* NIST: Curve K-571 : y^2+xy=x^3+ax^2+b */                                                                          \
        CURVE_K_571,                                                                                                         \
        143,    /* Echar */                                                                                                  \
        "00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000", \
        "00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001", \
        "26eb7a859923fbc82189631f8103fe4ac9ca2970012d5d46024804801841ca44370958493b205e647da304db4ceb08cbbd1ba39494776fb988b47174dca88c7e2945283a01c8972", \
        "349dc807f4fbf374f4aeade3bca95314dd58cec9f307a54ffc61efc006d8a2c9d4979c0ac44aea74fbebbb9f772aedcb620b01a7ba7af1b320430c8591984f601cd4c143ef1c7a3", \
        68,     /* Epl */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF000000000000000000000001",  /* "26959946667150639794667015087019630673557916260026308143510066298881" */ \
        172,    /* Eol */                                                                                                    \
        "20000000000000000000000000000000000000000000000000000000000000000000000131850E1F19A63E4B391A8DB917F4138B630D84BE5D639381E91DEB45CFE778F637C1001",  /* "1932268761508629172347675945465993672149463664853217499328617625725759571144780212268133978522706711834706712800825351461273674974066617311929682421617092503555733685276673" */ \
        571,    /* key_len */                                                                                                \
        10,                                                                                                                  \
        5,                                                                                                                   \
        2,                                                                                                                   \
        CURVE_GF_2M                                                                                                          \
    }

#define CURVE_DATA_KO192 \
    {\
        /* Koblitz: Curve secp192k1 : y2 = x3+ax+b over Fp */                                                                \
        CURVE_KO_192,                                                                                                        \
        48,     /* Echar */                                                                                                  \
        "00000000000000000000000000000000000000000",                                                                         \
        "00000000000000000000000000000000000000003",                                                                         \
        "DB4FF10EC057E9AE26B07D0280B7F4341DA5D1B1EAE06C7D",                                                                  \
        "9B2F2F6D9C5628A7844163D015BE86344082AA88D95E2F9D",                                                                  \
        58,     /* Epl */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFEFFFFEE37",  /* p */                                                         \
        58,     /* Eol */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFE26F2FC170F69466A74DEFD8D",  /* n */                                                         \
        192,    /* key_len */                                                                                                \
        7,                                                                                                                   \
        2,                                                                                                                   \
        1,                                                                                                                   \
        CURVE_GF_P                                                                                                           \
    }

