OpenNuvoton/M55M1BSP/Library/StdDriver/src/crypto.c
#define CURVE_DATA_KO224 \
    {\
        /* Koblitz: Curve secp224k1 : y2 = x3+ax+b over Fp */                                                                \
        CURVE_KO_224,                                                                                                        \
        56,     /* Echar */                                                                                                  \
        "00000000000000000000000000000000000000000000000000000000",                                                          \
        "00000000000000000000000000000000000000000000000000000005",                                                          \
        "A1455B334DF099DF30FC28A169A467E9E47075A90F7E650EB6B7A45C",                                                          \
        "7E089FED7FBA344282CAFBD6F7E319F7C0B0BD59E2CA4BDB556D61A5",                                                          \
        70,     /* Epl */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFEFFFFE56D",  /* p */                                                 \
        70,     /* Eol */                                                                                                    \
        "0000000000000000000000000001DCE8D2EC6184CAF0A971769FB1F7",  /* n */                                                 \
        224,    /* key_len */                                                                                                \
        7,                                                                                                                   \
        2,                                                                                                                   \
        1,                                                                                                                   \
        CURVE_GF_P                                                                                                           \
    }

#define CURVE_DATA_KO256 \
    {\
        /* Koblitz: Curve secp256k1 : y2 = x3+ax+b over Fp */                                                                \
        CURVE_KO_256,                                                                                                        \
        64,     /* Echar */                                                                                                  \
        "0000000000000000000000000000000000000000000000000000000000000000",                                                  \
        "0000000000000000000000000000000000000000000000000000000000000007",                                                  \
        "79BE667EF9DCBBAC55A06295CE870B07029BFCDB2DCE28D959F2815B16F81798",                                                  \
        "483ADA7726A3C4655DA4FBFC0E1108A8FD17B448A68554199C47D08FFB10D4B8",                                                  \
        78,     /* Epl */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFEFFFFFC2F",  /* p */                                         \
        78,     /* Eol */                                                                                                    \
        "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFEBAAEDCE6AF48A03BBFD25E8CD0364141",  /* n */                                         \
        256,    /* key_len */                                                                                                \
        7,                                                                                                                   \
        2,                                                                                                                   \
        1,                                                                                                                   \
        CURVE_GF_P                                                                                                           \
    }

#define CURVE_DATA_BP256 \
    {\
        /* Brainpool: Curve brainpoolP256r1 */                                                                               \
        CURVE_BP_256,                                                                                                        \
        64,     /* Echar */                                                                                                  \
        "7D5A0975FC2C3057EEF67530417AFFE7FB8055C126DC5C6CE94A4B44F330B5D9",  /* A */                                         \
        "26DC5C6CE94A4B44F330B5D9BBD77CBF958416295CF7E1CE6BCCDC18FF8C07B6",  /* B */                                         \
        "8BD2AEB9CB7E57CB2C4B482FFC81B7AFB9DE27E1E3BD23C23A4453BD9ACE3262",  /* x */                                         \
        "547EF835C3DAC4FD97F8461A14611DC9C27745132DED8E545C1D54C72F046997",  /* y */                                         \
        78,     /* Epl */                                                                                                    \
        "A9FB57DBA1EEA9BC3E660A909D838D726E3BF623D52620282013481D1F6E5377",  /* p */                                         \
        78,     /* Eol */                                                                                                    \
        "A9FB57DBA1EEA9BC3E660A909D838D718C397AA3B561A6F7901E0E82974856A7",  /* q */                                         \
        256,    /* key_len */                                                                                                \
        7,                                                                                                                   \
        2,                                                                                                                   \
        1,                                                                                                                   \
        CURVE_GF_P                                                                                                           \
    }

#define CURVE_DATA_BP384 \
    {\
        /* Brainpool: Curve brainpoolP384r1 */                                                                               \
        CURVE_BP_384,                                                                                                        \
        96,     /* Echar */                                                                                                  \
        "7BC382C63D8C150C3C72080ACE05AFA0C2BEA28E4FB22787139165EFBA91F90F8AA5814A503AD4EB04A8C7DD22CE2826",  /* A */         \
        "04A8C7DD22CE28268B39B55416F0447C2FB77DE107DCD2A62E880EA53EEB62D57CB4390295DBC9943AB78696FA504C11",  /* B */         \
        "1D1C64F068CF45FFA2A63A81B7C13F6B8847A3E77EF14FE3DB7FCAFE0CBD10E8E826E03436D646AAEF87B2E247D4AF1E",  /* x */         \
        "8ABE1D7520F9C2A45CB1EB8E95CFD55262B70B29FEEC5864E19C054FF99129280E4646217791811142820341263C5315",  /* y */         \
        116,     /* Epl */                                                                                                   \
        "8CB91E82A3386D280F5D6F7E50E641DF152F7109ED5456B412B1DA197FB71123ACD3A729901D1A71874700133107EC53",  /* p */         \
        116,     /* Eol */                                                                                                   \
        "8CB91E82A3386D280F5D6F7E50E641DF152F7109ED5456B31F166E6CAC0425A7CF3AB6AF6B7FC3103B883202E9046565",  /* q */         \
        384,    /* key_len */                                                                                                \
        7,                                                                                                                   \
        2,                                                                                                                   \
        1,                                                                                                                   \
        CURVE_GF_P                                                                                                           \
    }

#define CURVE_DATA_BP512 \
    {\
        /* Brainpool: Curve brainpoolP512r1 */                                                                               \
        CURVE_BP_512,                                                                                                        \
        128,     /* Echar */                                                                                                 \
        "7830A3318B603B89E2327145AC234CC594CBDD8D3DF91610A83441CAEA9863BC2DED5D5AA8253AA10A2EF1C98B9AC8B57F1117A72BF2C7B9E7C1AC4D77FC94CA",  /* A */ \
        "3DF91610A83441CAEA9863BC2DED5D5AA8253AA10A2EF1C98B9AC8B57F1117A72BF2C7B9E7C1AC4D77FC94CADC083E67984050B75EBAE5DD2809BD638016F723",  /* B */ \
        "81AEE4BDD82ED9645A21322E9C4C6A9385ED9F70B5D916C1B43B62EEF4D0098EFF3B1F78E2D0D48D50D1687B93B97D5F7C6D5047406A5E688B352209BCB9F822",  /* x */ \
        "7DDE385D566332ECC0EABFA9CF7822FDF209F70024A57B1AA000C55B881F8111B2DCDE494A5F485E5BCA4BD88A2763AED1CA2B2FA8F0540678CD1E0F3AD80892",  /* y */ \
        156,     /* Epl */                                                                                                   \
        "AADD9DB8DBE9C48B3FD4E6AE33C9FC07CB308DB3B3C9D20ED6639CCA703308717D4D9B009BC66842AECDA12AE6A380E62881FF2F2D82C68528AA6056583A48F3",  /* p */ \
        156,     /* Eol */                                                                                                   \
        "AADD9DB8DBE9C48B3FD4E6AE33C9FC07CB308DB3B3C9D20ED6639CCA70330870553E5C414CA92619418661197FAC10471DB1D381085DDADDB58796829CA90069",  /* q */ \
        512,    /* key_len */                                                                                                \
        7,                                                                                                                   \
        2,                                                                                                                   \
        1,                                                                                                                   \
        CURVE_GF_P                                                                                                           \
    }

#define CURVE_DATA_25519 \
    {\
        CURVE_25519,                                                                                                         \
        64,     /* Echar */                                                                                                  \
        "0000000000000000000000000000000000000000000000000000000000076D06",  /* "0000000000000000000000000000000000000000000000000000000000000003" */ \
        "0000000000000000000000000000000000000000000000000000000000000001",                                                  \
        "0000000000000000000000000000000000000000000000000000000000000009",                                                  \
        "20ae19a1b8a086b4e01edd2c7748d14c923d4d7e6d7c61b229e9c5a27eced3d9",                                                  \
        78,     /* Epl */                                                                                                    \
        "7FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFED",  /* "115792089210356248762697446949407573530086143415290314195533631308867097853951" */ \
        78,     /* Eol */                                                                                                    \
        "1000000000000000000000000000000014def9dea2f79cd65812631a5cf5d3ed",  /* "115792089210356248762697446949407573529996955224135760342422259061068512044369" */ \
        255,    /* key_len */                                                                                                \
        10,                                                                                                                  \
        5,                                                                                                                   \
        2,                                                                                                                   \
        CURVE_GF_P                                                                                                           \
    }

#define CURVE_DATA_SM2_256 \
    {\
        /* SM2 sugguestion Curve P-256 : y^2=x^3+ax+b  */                                                                    \
        CURVE_SM2_256,                                                                                                       \
        64,     /* Echar */                                                                                                  \
        "FFFFFFFEFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF00000000FFFFFFFFFFFFFFFC",  /* a */                                         \
        "28E9FA9E9D9F5E344D5A9E4BCF6509A7F39789F515AB8F92DDBCBD414D940E93",  /* b */                                         \
        "32C4AE2C1F1981195F9904466A39C9948FE30BBFF2660BE1715A4589334C74C7",  /* x */                                         \
        "BC3736A2F4F6779C59BDCEE36B692153D0A9877CC62A474002DF32E52139F0A0",  /* y */                                         \
        78,     /* Epl */                                                                                                    \
        "FFFFFFFEFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF00000000FFFFFFFFFFFFFFFF",  /* p */                                         \
        78,     /* Eol */                                                                                                    \
        "FFFFFFFEFFFFFFFFFFFFFFFFFFFFFFFF7203DF6B21C6052B53BBF40939D54123",  /* n */                                         \
        256,    /* key_len */                                                                                                \
        10,                                                                                                                  \
        5,                                                                                                                   \
        2,                                                                                                                   \
        CURVE_GF_P                                                                                                           \
    }

#if defined(ENABLE_DEBUG)
static void dump_ecc_reg(char *str, uint32_t volatile regs[], int32_t count)
{
    int32_t  i;

    printf("%s => ", str);

    for (i = 0; i < count; i++)
    {
        printf("0x%08x ", regs[i]);
    }

    printf("\n");
}
#endif

static char  ch2hex(char ch)
{
    char value = ch;

    if (value <= '9')
    {
        value = value - '0';
    }
    else if ((value <= 'z') && (value >= 'a'))
    {
        value = value - 'a' + 10U;
    }
    else
    {
        value = value - 'A' + 10U;
    }

    return value;
}


