OpenNuvoton/M55M1BSP/Library/StdDriver/src/crypto.c
static int  __strlen(const char *str)
{
    const char  *p = str;
    int   len = 0;

    while (*p != 0)
    {
        p++;
        len++;

        if (len > 1024)   /* max. 4096 bits */
        {
            break;
        }
    }

    // printf("< %d >\n", len);
    return len;
}

void Hex2Reg(const char input[], uint32_t volatile reg[])
{
    int       si;
    int       ri;
    uint32_t  i;

    si = (int)__strlen(input) - 1;
    ri = 0;

    // printf("<%d>\n", si);

    while (si >= 0)
    {
        uint32_t  val32 = 0UL;

        for (i = 0UL; (i < 8UL) && (si >= 0); i++)
        {
            char      hex;

            hex = ch2hex(input[si]);
            val32 |= (uint32_t)hex << (i * 4UL);
            si--;
        }

        reg[ri] = val32;
        ri++;
    }
}

void Hex2RegEx(const char input[], uint32_t volatile reg[], int shift)
{
    uint32_t  carry;
    int       si;
    int       ri;
    uint32_t  i;

    si = (int)__strlen(input) - 1;
    ri = 0L;
    carry = 0UL;

    while (si >= 0)
    {
        uint32_t  val32 = 0UL;

        for (i = 0UL; (i < 8UL) && (si >= 0L); i++)
        {
            uint32_t  hex;

            hex = (uint32_t)ch2hex(input[si]);
            hex <<= shift;

            val32 |= (uint32_t)((hex & 0xFUL) | carry) << (i * 4UL);
            carry = (hex >> 4UL) & 0xFUL;
            si--;
        }

        reg[ri] = val32;
        ri++;
    }

    if (carry != 0UL)
    {
        reg[ri] = carry;
    }
}

/**
  * @brief  Extract specified nibble from an unsigned word in character format.
  *         For example:
  *                Suppose val32 is 0x786543210, get_Nth_nibble_char(val32, 3) will return a '3'.
  * @param[in]  val32   The input unsigned word
  * @param[in]  idx     The Nth nibble to be extracted.
  * @return  The nibble in character format.
  */
static char get_Nth_nibble_char(uint32_t val32, uint32_t idx)
{
    static const char hex_char_tbl[] = "0123456789abcdef";

    return hex_char_tbl[(val32 >> (idx * 4U)) & 0xfU ];
}


void Reg2Hex(int32_t count, const uint32_t volatile reg[], char output[])
{
    int32_t    idx;
    int32_t    ri;
    uint32_t   i;

    output[count] = 0U;
    idx = count - 1;

    ri = 0;

    while (idx >= 0)
    {
        for (i = 0UL; (i < 8UL) && (idx >= 0); i++)
        {
            output[idx] = get_Nth_nibble_char(reg[ri], i);
            idx--;
        }

        ri++;
    }
}


static ECC_CURVE *get_curve(E_ECC_CURVE ecc_curve)
{
    uint32_t   i;
    ECC_CURVE *ret = (ECC_CURVE *)NULL;
    static ECC_CURVE  Curve_Copy;

    static const ECC_CURVE _Curve[] =
    {
        CURVE_DATA_P192,
        CURVE_DATA_P224,
        CURVE_DATA_P256,
        CURVE_DATA_P384,
        CURVE_DATA_P521,
        CURVE_DATA_B163,
        CURVE_DATA_B233,
        CURVE_DATA_B283,
        CURVE_DATA_B409,
        CURVE_DATA_B571,
        CURVE_DATA_K163,
        CURVE_DATA_K233,
        CURVE_DATA_K283,
        CURVE_DATA_K409,
        CURVE_DATA_K571,
        CURVE_DATA_KO192,
        CURVE_DATA_KO224,
        CURVE_DATA_KO256,
        CURVE_DATA_BP256,
        CURVE_DATA_BP384,
        CURVE_DATA_BP512,
        CURVE_DATA_25519,
        CURVE_DATA_SM2_256
    };

    for (i = 0UL; i < (uint32_t)(sizeof(_Curve) / sizeof(ECC_CURVE)); i++)
    {
        if (ecc_curve == _Curve[i].curve_id)
        {
            Curve_Copy = _Curve[i];
            ret = &Curve_Copy;
        }

        if (ret != (ECC_CURVE *)NULL)
        {
            break;
        }
    }

    return ret;
}

static int32_t ecc_init_curve(CRYPTO_T *crypto, E_ECC_CURVE ecc_curve)
{
    int32_t  i;
    int32_t  ret = 0;
    pCurve = get_curve(ecc_curve);

    if (pCurve == (ECC_CURVE *)NULL)
    {
        CRYPTO_DBGMSG("Cannot find curve %d!!\n", ecc_curve);
        ret = -1;
    }

    if (ret == 0)
    {
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_A[i] = 0UL;
            crypto->ECC_B[i] = 0UL;
            crypto->ECC_X1[i] = 0UL;
            crypto->ECC_Y1[i] = 0UL;
            crypto->ECC_X2[i] = 0UL;
            crypto->ECC_Y2[i] = 0UL;
            crypto->ECC_N[i] = 0UL;
        }

        Hex2Reg(pCurve->Ea, crypto->ECC_A);
        Hex2Reg(pCurve->Eb, crypto->ECC_B);
        Hex2Reg(pCurve->Px, crypto->ECC_X1);
        Hex2Reg(pCurve->Py, crypto->ECC_Y1);

        CRYPTO_DBGMSG("Key length = %d\n", pCurve->key_len);
#if defined(ENABLE_DEBUG)
        dump_ecc_reg("CRYPTO_ECC_CURVE_A", crypto->ECC_A, 10);
        dump_ecc_reg("CRYPTO_ECC_CURVE_B", crypto->ECC_B, 10);
        dump_ecc_reg("CRYPTO_ECC_POINT_X1", crypto->ECC_X1, 10);
        dump_ecc_reg("CRYPTO_ECC_POINT_Y1", crypto->ECC_Y1, 10);
#endif

        if (pCurve->GF == (int)CURVE_GF_2M)
        {
            uint32_t key_len_word;
            uint32_t key_len_bit;
            uint32_t irreducible_k1_word;
            uint32_t irreducible_k1_bit;
            uint32_t irreducible_k2_word;
            uint32_t irreducible_k2_bit;
            uint32_t irreducible_k3_word;
            uint32_t irreducible_k3_bit;

            key_len_word = (uint32_t)pCurve->key_len / 32UL;
            key_len_bit = (uint32_t)pCurve->key_len % 32UL;
            irreducible_k1_word = (uint32_t)pCurve->irreducible_k1 / 32UL;
            irreducible_k1_bit = (uint32_t)pCurve->irreducible_k1 % 32UL;
            irreducible_k2_word = (uint32_t)pCurve->irreducible_k2 / 32UL;
            irreducible_k2_bit = (uint32_t)pCurve->irreducible_k2 % 32UL;
            irreducible_k3_word = (uint32_t)pCurve->irreducible_k3 / 32UL;
            irreducible_k3_bit = (uint32_t)pCurve->irreducible_k3 % 32UL;

            crypto->ECC_N[0] = 0x1UL;
            crypto->ECC_N[key_len_word] |= (1UL << key_len_bit);
            crypto->ECC_N[irreducible_k1_word] |= (1UL << irreducible_k1_bit);
            crypto->ECC_N[irreducible_k2_word] |= (1UL << irreducible_k2_bit);
            crypto->ECC_N[irreducible_k3_word] |= (1UL << irreducible_k3_bit);
        }
        else
        {
            Hex2Reg(pCurve->Pp, crypto->ECC_N);
        }
    }

#if defined(ENABLE_DEBUG)
    dump_ecc_reg("Init N:", crypto->ECC_N, 18);
    dump_ecc_reg("CRYPTO_ECC_CURVE_N", crypto->ECC_N, 10);
#endif
    return ret;
}

int32_t ECC_GetCurve(CRYPTO_T *crypto, E_ECC_CURVE ecc_curve, ECC_CURVE *curve)
{
    int32_t err;

