OpenNuvoton/M55M1BSP/Library/StdDriver/src/crypto.c
    /* Update pCurve pointer */
    err = ecc_init_curve(crypto, ecc_curve);

    if (err == 0)
    {
        /* get curve */
        *curve = *pCurve;
    }

    return err;
}

static int  get_nibble_value(char c)
{
    char value = c;

    if ((value >= '0') && (value <= '9'))
    {
        value = value - '0';
    }

    if ((value >= 'a') && (value <= 'f'))
    {
        value = value - 'a' + (char)10;
    }

    if ((value >= 'A') && (value <= 'F'))
    {
        value = value - 'A' + (char)10;
    }

    return (int)value;
}

int ecc_strcmp(const char *s1, const char *s2)
{
    char  c1;
    char  c2;
    const char  *lhs = s1;
    const char  *rhs = s2;

    while (*lhs == '0')
    {
        lhs++;
    }

    while (*rhs == '0')
    {
        rhs++;
    }

    while ((*lhs != '\0') || (*rhs != '\0'))
    {
        if ((*lhs >= 'A') && (*lhs <= 'Z'))
        {
            c1 = *lhs + 32;
        }
        else
        {
            c1 = *lhs;
        }

        if ((*rhs >= 'A') && (*rhs <= 'Z'))
        {
            c2 = *rhs + 32;
        }
        else
        {
            c2 = *rhs;
        }

        if (c1 != c2)
        {
            return 1;
        }

        lhs++;
        rhs++;
    }

    return 0;
}

volatile uint32_t g_ECC_done;
volatile uint32_t g_ECCERR_done;

/** @endcond HIDDEN_SYMBOLS */

/**
  * @brief  ECC interrupt service routine. User application must invoke this function in
  *         his CRYPTO_IRQHandler() to let Crypto driver know ECC processing was done.
  * @param[in]  crypto        Reference to Crypto module.
  * @return   none
  */
void ECC_Complete(CRYPTO_T *crypto)
{
    if (crypto->INTSTS & CRYPTO_INTSTS_ECCIF_Msk)
    {
        g_ECC_done = 1UL;
        crypto->INTSTS = CRYPTO_INTSTS_ECCIF_Msk;
    }

    if (crypto->INTSTS & CRYPTO_INTSTS_ECCEIF_Msk)
    {
        g_ECCERR_done = 1UL;
        crypto->INTSTS = CRYPTO_INTSTS_ECCEIF_Msk;

        while (1)
        {
        }
    }
}

/**
  * @brief  Check if the private key is located in valid range of curve.
  * @param[in]  crypto        Reference to Crypto module.
  * @param[in]  ecc_curve   The pre-defined ECC curve.
  * @param[in]  private_k   The input private key.
  * @return  1    Is valid.
  * @return  0    Is not valid.
  * @return  -1   Invalid curve.
  */
int ECC_IsPrivateKeyValid(CRYPTO_T *crypto, E_ECC_CURVE ecc_curve, const char private_k[])
{
    int32_t  i;
    int      ret;
    const char *key = private_k;

    (void)(crypto);
    pCurve = get_curve(ecc_curve);

    if (pCurve == (ECC_CURVE *)NULL)
    {
        return -1;
    }

    while (*key == '0')
    {
        key++;
    }

    if (*key == '\0')
    {
        return 0;
    }

    if (__strlen(key) < __strlen(pCurve->Eorder))
    {
        return 1;
    }

    if (__strlen(key) > __strlen(pCurve->Eorder))
    {
        return 0;
    }

    ret = 0;

    for (i = 0; (i < __strlen(key)) && (ret == 0); i++)
    {
        int key_value;
        int order_value;

        key_value = get_nibble_value(key[i]);
        order_value = get_nibble_value(pCurve->Eorder[i]);

        if (key_value < order_value)
        {
            ret = 1;
        }
        else if (key_value > order_value)
        {
            ret = 0;
        }
        else
        {
        }
    }

    return ret;
}

/**
  * @brief  Given a private key and curve to generate the public key pair.
  * @param[in]  crypto        Reference to Crypto module.
  * @param[in]  private_k   The input private key.
  * @param[in]  ecc_curve   The pre-defined ECC curve.
  * @param[out] public_k1   The output public key 1.
  * @param[out] public_k2   The output public key 2.
  * @return  0    Success.
  * @return  -1   "ecc_curve" value is invalid.
  */
int32_t  ECC_GeneratePublicKey(CRYPTO_T *crypto, E_ECC_CURVE ecc_curve, char *private_k, char public_k1[], char public_k2[])
{
    int32_t  ret = 0;

    if (ecc_init_curve(crypto, ecc_curve) != 0)
    {
        ret = -1;
    }

    if (ret == 0)
    {
        int32_t  i;

        for (i = 0; i < 18; i++)
        {
            crypto->ECC_K[i] = 0UL;
        }

        Hex2Reg(private_k, crypto->ECC_K);

        /* set FSEL (Field selection) */
        if (pCurve->GF == (int)CURVE_GF_2M)
        {
            crypto->ECC_CTL = 0UL;
        }
        else
        {
            /*  CURVE_GF_P */
            crypto->ECC_CTL = CRYPTO_ECC_CTL_FSEL_Msk;
        }

        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X2[i] = 0UL;
        }

        Hex2Reg(pCurve->Eorder, crypto->ECC_X2);

        if (ecc_curve == CURVE_25519)
        {
            // dump_ecc_reg("CRYPTO_ECC_POINT_X2", crypto->ECC_X2, 10);
            // crypto->ECC_CTL |= CRYPTO_ECC_CTL_SCAP_Msk;
            crypto->ECC_CTL |= CRYPTO_ECC_CTL_SPCEN_Msk;
        }

        /* enable side-channel attack protection */
        crypto->ECC_CTL |= CRYPTO_ECC_CTL_SCAP_Msk | CRYPTO_ECC_CTL_ASCAP_Msk;

        g_ECC_done = 0UL;
        g_ECCERR_done = 0UL;
        crypto->ECC_CTL |= ((uint32_t)pCurve->key_len << CRYPTO_ECC_CTL_CURVEM_Pos) |
                           ECCOP_POINT_MUL | CRYPTO_ECC_CTL_PFA2C_Msk | CRYPTO_ECC_CTL_START_Msk;

        while ((g_ECC_done == 0UL) && (g_ECCERR_done == 0UL))
        {
            CRYPTO_DBGMSG("ECC_start\n");
        }

        Reg2Hex(pCurve->Echar, crypto->ECC_X1, public_k1);
        Reg2Hex(pCurve->Echar, crypto->ECC_Y1, public_k2);
    }

    return ret;
}

/**
  * @brief  Given a private key from Key Store to generate the public key pair.
  * @param[in]  crypto        Reference to Crypto module.
  * @param[in]  ecc_curve   The pre-defined ECC curve.
  * @param[in]  k_ksnum     k_ksnum >= 0x80: Use Key Store OTP key number "k_ksnum - 0x80" as input private key
  *                         k_ksnum >= 0:    Use Key Store SRAM key number k_ksnum as input private key
  * @param[in]  is_ecdh     Key Store key was written with ECDH bit enable
  * @param[out] public_k1   The output public key 1.
  * @param[out] public_k2   The output public key 2.
  * @return  0    Success.
  * @return  -1   "ecc_curve" value is invalid.
  */
int32_t  ECC_GeneratePublicKey_KS(CRYPTO_T *crypto, E_ECC_CURVE ecc_curve, int k_ksnum, int is_ecdh, char public_k1[], char public_k2[])
{
    int32_t  ret = 0;

    if (ecc_init_curve(crypto, ecc_curve) != 0)
    {
        ret = -1;
    }

    if (ret == 0)
    {
        int32_t  i;

        for (i = 0; i < 18; i++)
        {
            crypto->ECC_K[i] = 0UL;
        }

        if (k_ksnum >= 0x80)
        {
            if (is_ecdh)
            {
                crypto->ECC_KSCTL = (0x2UL << CRYPTO_ECC_KSCTL_RSSRCK_Pos) | CRYPTO_ECC_KSCTL_ECDH_Msk |
                                    CRYPTO_ECC_KSCTL_RSRCK_Msk | ((uint32_t)k_ksnum - 0x80UL);
            }
            else
            {
                crypto->ECC_KSCTL = (0x2UL << CRYPTO_ECC_KSCTL_RSSRCK_Pos) |
                                    CRYPTO_ECC_KSCTL_RSRCK_Msk | ((uint32_t)k_ksnum - 0x80UL);
            }
        }
        else
        {
            if (is_ecdh)
            {
                crypto->ECC_KSCTL = (0UL << CRYPTO_ECC_KSCTL_RSSRCK_Pos) | CRYPTO_ECC_KSCTL_ECDH_Msk |
                                    CRYPTO_ECC_KSCTL_RSRCK_Msk | (uint32_t)k_ksnum;
            }
            else
            {
                crypto->ECC_KSCTL = (0UL << CRYPTO_ECC_KSCTL_RSSRCK_Pos) |
                                    CRYPTO_ECC_KSCTL_RSRCK_Msk | (uint32_t)k_ksnum;
            }
        }

