OpenNuvoton/M55M1BSP/Library/StdDriver/src/crypto.c
        /* set FSEL (Field selection) */
        if (pCurve->GF == (int)CURVE_GF_2M)
        {
            crypto->ECC_CTL = 0UL;
        }
        else
        {
            /*  CURVE_GF_P */
            crypto->ECC_CTL = CRYPTO_ECC_CTL_FSEL_Msk;
        }

        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X2[i] = 0UL;
        }

        Hex2Reg(pCurve->Eorder, crypto->ECC_X2);

        g_ECC_done = 0UL;
        g_ECCERR_done = 0UL;
        crypto->ECC_CTL |= ((uint32_t)pCurve->key_len << CRYPTO_ECC_CTL_CURVEM_Pos) |
                           ECCOP_POINT_MUL | CRYPTO_ECC_CTL_START_Msk;

        while ((g_ECC_done == 0UL) && (g_ECCERR_done == 0UL))
        {
        }

        crypto->ECC_KSCTL = 0;

        Reg2Hex(pCurve->Echar, crypto->ECC_X1, public_k1);
        Reg2Hex(pCurve->Echar, crypto->ECC_Y1, public_k2);
    }

    return ret;
}

/**
  * @brief  Given a private key and curve to generate the public key pair.
  * @param[in]  crypto        Reference to Crypto module.
  * @param[out] x1          The x-coordinate of input point.
  * @param[out] y1          The y-coordinate of input point.
  * @param[in]  k           The private key
  * @param[in]  ecc_curve   The pre-defined ECC curve.
  * @param[out] x2          The x-coordinate of output point.
  * @param[out] y2          The y-coordinate of output point.
  * @return  0    Success.
  * @return  -1   "ecc_curve" value is invalid.
  */
int32_t  ECC_Mutiply(CRYPTO_T *crypto, E_ECC_CURVE ecc_curve, char x1[], char y1[], char *k, char x2[], char y2[])
{
    int32_t  ret = 0;

    if (ecc_init_curve(crypto, ecc_curve) != 0)
    {
        ret = -1;
    }

    if (ret == 0)
    {
        int32_t  i;

        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X1[i] = 0UL;
            crypto->ECC_Y1[i] = 0UL;
            crypto->ECC_K[i] = 0UL;
        }

        Hex2Reg(x1, crypto->ECC_X1);
        Hex2Reg(y1, crypto->ECC_Y1);
        Hex2Reg(k, crypto->ECC_K);

        /* set FSEL (Field selection) */
        if (pCurve->GF == (int)CURVE_GF_2M)
        {
            crypto->ECC_CTL = 0UL;
        }
        else
        {
            /*  CURVE_GF_P */
            crypto->ECC_CTL = CRYPTO_ECC_CTL_FSEL_Msk;
        }

        g_ECC_done = 0UL;
        g_ECCERR_done = 0UL;
        crypto->ECC_CTL |= ((uint32_t)pCurve->key_len << CRYPTO_ECC_CTL_CURVEM_Pos) |
                           ECCOP_POINT_MUL | CRYPTO_ECC_CTL_START_Msk;

        while ((g_ECC_done == 0UL) && (g_ECCERR_done == 0UL))
        {
        }

        Reg2Hex(pCurve->Echar, crypto->ECC_X1, x2);
        Reg2Hex(pCurve->Echar, crypto->ECC_Y1, y2);
    }

    return ret;
}

/**
  * @brief  Given a private key and curve to generate the public key pair.
  * @param[in]  crypto        Reference to Crypto module.
  * @param[in]  x1_ksnum    -1:  do not use Key Store, instead, use x1 as input point X
  *                         x1_ksnum >= 0x80: Use Key Store OTP key number "x1_ksnum - 0x80" as input point X
  *                         x1_ksnum >= 0:    Use Key Store SRAM key number x1_ksnum as input point X
  * @param[out] x1          The input point X.
  * @param[in]  y1_ksnum    -1:  do not use Key Store, instead, use y1 as input point X
  *                         y1_ksnum >= 0x80: Use Key Store OTP key number "y1_ksnum - 0x80" as input point Y
  *                         y1_ksnum >= 0:    Use Key Store SRAM key number y1_ksnum as input point Y
  * @param[out] y1          The input point Y.
  * @param[in]  k_ksnum     -1:  do not use Key Store, instead, use k as input multiplier
  *                         k_ksnum >= 0x80: Use Key Store OTP key number "k_ksnum - 0x80" as input multiplier
  *                         k_ksnum >= 0:    Use Key Store SRAM key number k_ksnum as input multiplier
  * @param[in]  k           The multiplier
  * @param[in]  ecc_curve   The pre-defined ECC curve.
  * @param[out] x2          The x-coordinate of output point.
  * @param[out] y2          The y-coordinate of output point.
  * @return  0    Success.
  * @return  -1   "ecc_curve" value is invalid.
  */
int32_t  ECC_Mutiply_KS(CRYPTO_T *crypto, E_ECC_CURVE ecc_curve, int x1_ksnum, char x1[], int y1_ksnum, char y1[],
                        int k_ksnum, char *k, char x2[], char y2[])
{
    int32_t    ret = 0;

    if (ecc_init_curve(crypto, ecc_curve) != 0)
    {
        ret = -1;
    }

    if (ret == 0)
    {
        int32_t    i;
        uint32_t   ecc_ksxy = 0;

        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X1[i] = 0UL;
            crypto->ECC_Y1[i] = 0UL;
            crypto->ECC_K[i] = 0UL;
        }

        if (x1_ksnum >= 0x80)
        {
            ecc_ksxy |= (2UL << CRYPTO_ECC_KSXY_RSSRCX_Pos) | CRYPTO_ECC_KSXY_RSRCXY_Msk | ((uint32_t)x1_ksnum - 0x80UL);
        }
        else if (x1_ksnum >= 0)
        {
            ecc_ksxy |= (0UL << CRYPTO_ECC_KSXY_RSSRCX_Pos) | CRYPTO_ECC_KSXY_RSRCXY_Msk | (uint32_t)x1_ksnum;
        }
        else
        {
            Hex2Reg(x1, crypto->ECC_X1);
        }

        if (y1_ksnum >= 0x80)
        {
            ecc_ksxy |= (2UL << CRYPTO_ECC_KSXY_RSSRCY_Pos) | CRYPTO_ECC_KSXY_RSRCXY_Msk | ((uint32_t)y1_ksnum - 0x80UL);
        }
        else if (x1_ksnum >= 0)
        {
            ecc_ksxy |= (0UL << CRYPTO_ECC_KSXY_RSSRCY_Pos) | CRYPTO_ECC_KSXY_RSRCXY_Msk | (uint32_t)y1_ksnum;
        }
        else
        {
            Hex2Reg(y1, crypto->ECC_Y1);
        }

        crypto->ECC_KSXY = ecc_ksxy;

        if (k_ksnum >= 0x80)
        {
            crypto->ECC_KSCTL = (2UL << CRYPTO_ECC_KSCTL_RSSRCK_Pos) |
                                CRYPTO_ECC_KSCTL_RSRCK_Msk | ((uint32_t)k_ksnum - 0x80UL);
        }
        else if (k_ksnum >= 0)
        {
            crypto->ECC_KSCTL = (0UL << CRYPTO_ECC_KSCTL_RSSRCK_Pos) |
                                CRYPTO_ECC_KSCTL_RSRCK_Msk | (uint32_t)k_ksnum;
        }
        else
        {
            Hex2Reg(k, crypto->ECC_K);
        }

        /* set FSEL (Field selection) */
        if (pCurve->GF == (int)CURVE_GF_2M)
        {
            crypto->ECC_CTL = 0UL;
        }
        else
        {
            /*  CURVE_GF_P */
            crypto->ECC_CTL = CRYPTO_ECC_CTL_FSEL_Msk;
        }

