OpenNuvoton/M55M1BSP/Library/StdDriver/src/crypto.c
        /* 4-(4) Set CURVEM(CRYPTO_ECC_CTL[31:22]) to key length  */
        /* 4-(5) Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01            */
        /* 4-(6) Set ECDSAS(CRYPTO_ECC_CTL[4]) to 1               */
        /* 4-(7) Set START(CRYPTO_ECC_CTL[0]) to 1                */
        /* 4-(8) Wait for BUSY(CRYPTO_ECC_STS[0]) be cleared      */

        CRYPTO_DBGMSG("4-(8) Wait for BUSY be cleared...\n");

        run_ecc_codec(crypto, ECCOP_MODULE | MODOP_DIV | CRYPTO_ECC_CTL_ECDSAS_Msk, 0);
        crypto->ECC_KSXY = 0;

        /*  4-(9) Read X1 registers to get s */
        for (i = 0; i < 18; i++)
        {
            temp_result2[i] = crypto->ECC_X1[i];
        }

        Reg2Hex(pCurve->Echar, temp_result2, S);

    }  /* ret == 0 */

    return ret;
}


/**
  * @brief  ECDSA digital signature generation.
  * @param[in]  crypto        Reference to Crypto module.
  * @param[in]  ecc_curve   The pre-defined ECC curve.
  * @param[in]  message     The hash value of source context.
  * @param[in]  d_ksnum     d_ksnum >= 0x80: Use Key Store OTP key number "d_ksnum - 0x80" as input private key
  *                         d_ksnum >= 0:    Use Key Store SRAM key number d_ksnum as input private key
  * @param[in]  k_ksnum     k_ksnum >= 0x80: Use Key Store OTP key number "d_ksnum - 0x80" as input random number
  *                         k_ksnum >= 0:    Use Key Store SRAM key number d_ksnum as input random number
  * @param[out] R           R of the (R,S) pair digital signature
  * @param[out] S           S of the (R,S) pair digital signature
  * @return  0    Success.
  * @return  -1   "ecc_curve" value is invalid.
  */

int32_t  ECC_GenerateSignature_KS(CRYPTO_T *crypto, E_ECC_CURVE ecc_curve, char *message,
                                  int d_ksnum, int k_ksnum, char *R, char *S)
{
    uint32_t volatile temp_result1[18];
    uint32_t volatile temp_result2[18];
    uint32_t   ksxy;
    int32_t     i;
    int32_t     ret = 0;

    if (ecc_init_curve(crypto, ecc_curve) != 0)
    {
        ret = -1;
    }

    if (ret == 0)
    {
        /*
         *   1. Calculate e = HASH(m), where HASH is a cryptographic hashing algorithm, (i.e. SHA-1)
         *      (1) Use SHA to calculate e
         */

        /*   2. Select a random integer k form [1, n-1]
         *      (1) Notice that n is order, not prime modulus or irreducible polynomial function
         */

        /*
         *   3. Compute r = x1 (mod n), where (x1, y1) = k * G. If r = 0, go to step 2
         *      (1) Write the curve parameter A, B, and curve length M to corresponding registers
         *      (2) Write the prime modulus or irreducible polynomial function to N registers according
         *      (3) Write the point G(x, y) to X1, Y1 registers
         *      (4) Write the random integer k to K register
         *      (5) Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 00
         *      (6) Set FSEL(CRYPTO_ECC_CTL[8]) according to used curve of prime field or binary field
         *      (7) Set START(CRYPTO_ECC_CTL[0]) to 1
         *      (8) Wait for BUSY(CRYPTO_ECC_STS[0]) be cleared
         *      (9) Write the curve order and curve length to N ,M registers according
         *      (10) Write 0x0 to Y1 registers
         *      (11) Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
         *      (12) Set MOPOP(CRYPTO_ECC_CTL[12:11]) to 10
         *      (13) Set START(CRYPTO_ECC_CTL[0]) to 1         *
         *      (14) Wait for BUSY(CRYPTO_ECC_STS[0]) be cleared
         *      (15) Read X1 registers to get r
         */

        /* 3-(4) Write the random integer k to K register */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_K[i] = 0UL;
        }

        if (k_ksnum >= 0x80)
        {
            crypto->ECC_KSCTL = (0x2UL << CRYPTO_ECC_KSCTL_RSSRCK_Pos) |
                                CRYPTO_ECC_KSCTL_RSRCK_Msk | ((uint32_t)k_ksnum - 0x80UL);
        }
        else
        {
            crypto->ECC_KSCTL = (0UL << CRYPTO_ECC_KSCTL_RSSRCK_Pos) |
                                CRYPTO_ECC_KSCTL_RSRCK_Msk | (uint32_t)k_ksnum;
        }

        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X2[i] = 0UL;
        }

        Hex2Reg(pCurve->Eorder, crypto->ECC_X2);

        run_ecc_codec(crypto, ECCOP_POINT_MUL | CRYPTO_ECC_CTL_ECDSAR_Msk, 1);
        crypto->ECC_KSCTL = 0;

        /*  3-(9) Write the curve order to N registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_N[i] = 0UL;
        }

        Hex2Reg(pCurve->Eorder, crypto->ECC_N);

        /* 3-(10) Write 0x0 to Y1 registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_Y1[i] = 0UL;
        }

        CRYPTO_DBGMSG("second\n");
        run_ecc_codec(crypto, ECCOP_MODULE | MODOP_ADD, 0);

        /* 3-(15) Read X1 registers to get r */
        for (i = 0; i < 18; i++)
        {
            temp_result1[i] = crypto->ECC_X1[i];
        }

        Reg2Hex(pCurve->Echar, temp_result1, R);

#if defined(ENABLE_DEBUG)
        CRYPTO_DBGMSG("3-(15) R = %s\n", R);
#endif

        /*
         *   4. Compute s = k^-1 * (e + d * r)(mod n). If s = 0, go to step 2
         *      (1) Write the curve order to N registers
         *      (2) Write the random integer k to X1 and d to Y1
         *      (3) Write the r to X2 and e to Y2
         *      (4) Set CURVEM(CRYPTO_ECC_CTL[31:22]) to key length
         *      (5) Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
         *      (6) Set ECDSAS(CRYPTO_ECC_CTL[4]) to 1
         *      (7) Set START(CRYPTO_ECC_CTL[0]) to 1
         *      (8) Wait for BUSY(CRYPTO_ECC_STS[0]) be cleared
         *      (9) Read X1 registers to get s
         */

        /* S/W: GFp_add_mod_order(pCurve->key_len+2, 0, x1, a, R); */

        /*  4-(1) Write the curve order to N registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_N[i] = 0UL;
        }

        Hex2Reg(pCurve->Eorder, crypto->ECC_N);

        /*  4-(2) Write the random integer k to X1 and d to Y1 */

        ksxy = CRYPTO_ECC_KSXY_RSRCXY_Msk;

        if (k_ksnum >= 0x80)
        {
            ksxy |= (2UL << CRYPTO_ECC_KSXY_RSSRCX_Pos) | ((uint32_t)k_ksnum - 0x80UL);
        }
        else if (k_ksnum >= 0)
        {
            ksxy |= (0UL << CRYPTO_ECC_KSXY_RSSRCX_Pos) | (uint32_t)k_ksnum;
        }
        else
        {
            return -3;
        }

        if (d_ksnum >= 0x80)
        {
            ksxy |= (2UL << CRYPTO_ECC_KSXY_RSSRCY_Pos) | (((uint32_t)d_ksnum - 0x80UL) << 8U);
        }
        else if (d_ksnum >= 0)
        {
            ksxy |= (0UL << CRYPTO_ECC_KSXY_RSSRCY_Pos) | ((uint32_t)d_ksnum << 8U);
        }
        else
        {
            return -3;
        }

