OpenNuvoton/M55M1BSP/Library/StdDriver/src/crypto.c
        CRYPTO_DBGMSG("Write KSXY 0x%x\n", ksxy);
        crypto->ECC_KSXY = ksxy;


        /*  4-(3) Write the r to X2 and e to Y2 */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X2[i] = temp_result1[i];
        }

        for (i = 0; i < 18; i++)
        {
            crypto->ECC_Y2[i] = 0UL;
        }

        Hex2Reg(message, crypto->ECC_Y2);

        /* 4-(4) Set CURVEM(CRYPTO_ECC_CTL[31:22]) to key length  */
        /* 4-(5) Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01            */
        /* 4-(6) Set ECDSAS(CRYPTO_ECC_CTL[4]) to 1               */
        /* 4-(7) Set START(CRYPTO_ECC_CTL[0]) to 1                */
        /* 4-(8) Wait for BUSY(CRYPTO_ECC_STS[0]) be cleared      */

        CRYPTO_DBGMSG("4-(8) Wait for BUSY be cleared...\n");

        run_ecc_codec(crypto, ECCOP_MODULE | MODOP_DIV | CRYPTO_ECC_CTL_ECDSAS_Msk, 0);
        crypto->ECC_KSXY = 0;

        /*  4-(9) Read X1 registers to get s */
        for (i = 0; i < 18; i++)
        {
            temp_result2[i] = crypto->ECC_X1[i];
        }

        Reg2Hex(pCurve->Echar, temp_result2, S);

    }  /* ret == 0 */

    return ret;
}


/**
  * @brief  ECDSA digital signature verification.
  * @param[in]  crypto        Reference to Crypto module.
  * @param[in]  ecc_curve   The pre-defined ECC curve.
  * @param[in]  message     The hash value of source context.
  * @param[in]  public_k1   The public key 1.
  * @param[in]  public_k2   The public key 2.
  * @param[in]  R           R of the (R,S) pair digital signature
  * @param[in]  S           S of the (R,S) pair digital signature
  * @return  0    Success.
  * @return  -1   "ecc_curve" value is invalid.
  * @return  -2   Verification failed.
  */
int32_t  ECC_VerifySignature(CRYPTO_T *crypto, E_ECC_CURVE ecc_curve, char *message,
                             char *public_k1, char *public_k2, char *R, char *S)
{
    uint32_t  temp_result1[18];
    uint32_t  temp_result2[18];
    uint32_t  temp_x[18];
    char      temp_hex_str[160];
    uint32_t  temp_y[18];

    int32_t   i;
    int32_t   ret = 0;

    /*
     *   1. Verify that r and s are integers in the interval [1, n-1]. If not, the signature is invalid
     *   2. Compute e = HASH (m), where HASH is the hashing algorithm in signature generation
     *      (1) Use SHA to calculate e
     */

    /*
     *   3. Compute w = s^-1 (mod n)
     *      (1) Write the curve order to N registers
     *      (2) Write 0x1 to Y1 registers
     *      (3) Write s to X1 registers
     *      (4) Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
     *      (5) Set MOPOP(CRYPTO_ECC_CTL[12:11]) to 00
     *      (6) Set FSEL(CRYPTO_ECC_CTL[8]) according to used curve of prime field or binary field
     *      (7) Set START(CRYPTO_ECC_CTL[0]) to 1
     *      (8) Wait for BUSY(CRYPTO_ECC_STS[0]) be cleared
     *      (9) Read X1 registers to get w
     */
    if (ecc_init_curve(crypto, ecc_curve) != 0)
    {
        ret = -1;
    }

    if (ret == 0)
    {
        /*  3-(1) Write the curve order to N registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_N[i] = 0UL;
        }

        Hex2Reg(pCurve->Eorder, crypto->ECC_N);

        /*  3-(2) Write 0x1 to Y1 registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_Y1[i] = 0UL;
        }

        crypto->ECC_Y1[0] = 0x1UL;

        /*  3-(3) Write s to X1 registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X1[i] = 0UL;
        }

        Hex2Reg(S, crypto->ECC_X1);

        run_ecc_codec(crypto, ECCOP_MODULE | MODOP_DIV, 0);

        /*  3-(9) Read X1 registers to get w */
        for (i = 0; i < 18; i++)
        {
            temp_result2[i] = crypto->ECC_X1[i];
        }

#if defined(ENABLE_DEBUG)
        CRYPTO_DBGMSG("e = %s\n", message);
        Reg2Hex(pCurve->Echar, temp_result2, temp_hex_str);
        CRYPTO_DBGMSG("w = %s\n", temp_hex_str);
        CRYPTO_DBGMSG("o = %s (order)\n", pCurve->Eorder);
#endif

        /*
         *   4. Compute u1 = e * w (mod n) and u2 = r * w (mod n)
         *      (1) Write the curve order and curve length to N ,M registers
         *      (2) Write e, w to X1, Y1 registers
         *      (3) Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
         *      (4) Set MOPOP(CRYPTO_ECC_CTL[12:11]) to 01
         *      (5) Set START(CRYPTO_ECC_CTL[0]) to 1
         *      (6) Wait for BUSY(CRYPTO_ECC_STS[0]) be cleared
         *      (7) Read X1 registers to get u1
         *      (8) Write the curve order and curve length to N ,M registers
         *      (9) Write r, w to X1, Y1 registers
         *      (10) Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
         *      (11) Set MOPOP(CRYPTO_ECC_CTL[12:11]) to 01
         *      (12) Set START(CRYPTO_ECC_CTL[0]) to 1
         *      (13) Wait for BUSY(CRYPTO_ECC_STS[0]) be cleared
         *      (14) Read X1 registers to get u2
         */

        /*  4-(1) Write the curve order and curve length to N ,M registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_N[i] = 0UL;
        }

        Hex2Reg(pCurve->Eorder, crypto->ECC_N);

        /* 4-(2) Write e, w to X1, Y1 registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X1[i] = 0UL;
        }

        Hex2Reg(message, crypto->ECC_X1);

        for (i = 0; i < 18; i++)
        {
            crypto->ECC_Y1[i] = temp_result2[i];
        }

        run_ecc_codec(crypto, ECCOP_MODULE | MODOP_MUL, 0);

        /*  4-(7) Read X1 registers to get u1 */
        for (i = 0; i < 18; i++)
        {
            temp_result1[i] = crypto->ECC_X1[i];
        }

#if defined(ENABLE_DEBUG)
        Reg2Hex(pCurve->Echar, temp_result1, temp_hex_str);
        CRYPTO_DBGMSG("u1 = %s\n", temp_hex_str);
#endif

        /*  4-(8) Write the curve order and curve length to N ,M registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_N[i] = 0UL;
        }

        Hex2Reg(pCurve->Eorder, crypto->ECC_N);

        /* 4-(9) Write r, w to X1, Y1 registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X1[i] = 0UL;
        }

        Hex2Reg(R, crypto->ECC_X1);

        for (i = 0; i < 18; i++)
        {
            crypto->ECC_Y1[i] = temp_result2[i];
        }

        run_ecc_codec(crypto, ECCOP_MODULE | MODOP_MUL, 0);

        /*  4-(14) Read X1 registers to get u2 */
        for (i = 0; i < 18; i++)
        {
            temp_result2[i] = crypto->ECC_X1[i];
        }

#if defined(ENABLE_DEBUG)
        Reg2Hex(pCurve->Echar, temp_result2, temp_hex_str);
        CRYPTO_DBGMSG("u2 = %s\n", temp_hex_str);
#endif

