OpenNuvoton/M55M1BSP/Library/StdDriver/src/crypto.c
        /*
         *  (21) Write x1' to X1 registers
         *  (22) Write 0x0 to Y1 registers
         */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X1[i] = temp_x[i];
            crypto->ECC_Y1[i] = 0UL;
        }

#if defined(ENABLE_DEBUG)
        Reg2Hex(pCurve->Echar, crypto->ECC_X1, temp_hex_str);
        CRYPTO_DBGMSG("5-(21) x' = %s\n", temp_hex_str);
        Reg2Hex(pCurve->Echar, crypto->ECC_Y1, temp_hex_str);
        CRYPTO_DBGMSG("5-(22) y' = %s\n", temp_hex_str);
#endif

        run_ecc_codec(crypto, ECCOP_MODULE | MODOP_ADD, 0);

        /*  (27) Read X1 registers to get x1' (mod n) */
        Reg2Hex(pCurve->Echar, crypto->ECC_X1, temp_hex_str);
        CRYPTO_DBGMSG("5-(27) x1' (mod n) = %s\n", temp_hex_str);

        /* 6. The signature is valid if x1' = r, otherwise it is invalid */

        /* Compare with test pattern to check if r is correct or not */
        if (ecc_strcmp(temp_hex_str, R) != 0)
        {
            CRYPTO_DBGMSG("x1' (mod n) != R Test filed!!\n");
            CRYPTO_DBGMSG("Signature R [%s] is not matched with expected R [%s]!\n", temp_hex_str, R);
            ret = -2;
        }
    }  /* ret == 0 */

    return ret;
}

/** @cond HIDDEN_SYMBOLS */
static uintptr_t s_u32RSABufAddr;
static uint32_t s_u32RsaOpMode;
typedef enum
{
    BUF_NORMAL,
    BUF_CRT,
    BUF_CRTBYPASS,
    BUF_SCAP,
    BUF_CRT_SCAP,
    BUF_CRTBYPASS_SCAP,
    BUF_KS
} E_RSA_BUF_SEL;
static int32_t CheckRsaBufferSize(uint32_t u32OpMode, uint32_t u32BufSize, uint32_t u32UseKS);

static uint32_t *RSA_BufWordPtr(size_t u32Offset)
{
    return (uint32_t *)(s_u32RSABufAddr + (uintptr_t)u32Offset);
}

static uint32_t RSA_BufAddr(size_t u32Offset)
{
    return (uint32_t)(s_u32RSABufAddr + (uintptr_t)u32Offset);
}
/** @endcond HIDDEN_SYMBOLS */

/**
  * @brief  Check the allocated buffer size for RSA operation
  * @param[in]  u32OpMode          Mode of RSA, including:
  *          - \ref RSA_MODE_NORMAL
  *          - \ref RSA_MODE_CRT
  *          - \ref RSA_MODE_CRTBYPASS
  *          - \ref RSA_MODE_SCAP
  *          - \ref RSA_MODE_CRTBYPASS_SCAP
  * @param[in]  u32BufSize         RSA buffer size
  * @param[in]  u32UseKS           If RSA uses KeyStore(KS)
  * @return  0    Success.
  * @return  -1   The value of pointer of RSA buffer struct is NULL.
  */
static int32_t CheckRsaBufferSize(uint32_t u32OpMode, uint32_t u32BufSize, uint32_t u32UseKS)
{
    /* RSA buffer size for MODE_NORMAL, MODE_CRT, MODE_CRTBYPASS, MODE_SCAP, MODE_CRT_SCAP, MODE_CRTBYPASS_SCAP */
    const uint32_t s_au32RsaBufSizeTbl[] = {sizeof(RSA_BUF_NORMAL_T), sizeof(RSA_BUF_CRT_T), sizeof(RSA_BUF_CRT_T), \
                                            sizeof(RSA_BUF_SCAP_T), sizeof(RSA_BUF_CRT_SCAP_T), sizeof(RSA_BUF_CRT_SCAP_T), \
                                            sizeof(RSA_BUF_KS_T)
                                           };

    if (u32UseKS)
    {
        if (u32BufSize != s_au32RsaBufSizeTbl[BUF_KS])
        {
            return (-1);
        }
    }
    else
    {
        switch (u32OpMode)
        {
            case RSA_MODE_NORMAL:
                if (u32BufSize != s_au32RsaBufSizeTbl[BUF_NORMAL])
                {
                    return (-1);
                }

                break;

            case RSA_MODE_CRT:
                if (u32BufSize != s_au32RsaBufSizeTbl[BUF_CRT])
                {
                    return (-1);
                }

                break;

            case RSA_MODE_CRTBYPASS:
                if (u32BufSize != s_au32RsaBufSizeTbl[BUF_CRTBYPASS])
                {
                    return (-1);
                }

                break;

            case RSA_MODE_SCAP:
                if (u32BufSize != s_au32RsaBufSizeTbl[BUF_SCAP])
                {
                    return (-1);
                }

                break;

            case RSA_MODE_CRT_SCAP:
                if (u32BufSize != s_au32RsaBufSizeTbl[BUF_CRT_SCAP])
                {
                    return (-1);
                }

                break;

            case RSA_MODE_CRTBYPASS_SCAP:
                if (u32BufSize != s_au32RsaBufSizeTbl[BUF_CRTBYPASS_SCAP])
                {
                    return (-1);
                }

                break;

            default:
                return (-1);
        }
    }

    return 0;
}
/**
  * @brief  Open RSA encrypt/decrypt function.
  * @param[in]  crypto         The pointer of CRYPTO module
  * @param[in]  u32OpMode    RSA operation mode, including:
  *         - \ref RSA_MODE_NORMAL
  *         - \ref RSA_MODE_CRT
  *         - \ref RSA_MODE_CRTBYPASS
  *         - \ref RSA_MODE_SCAP
  *         - \ref RSA_MODE_CRT_SCAP
  *         - \ref RSA_MODE_CRTBYPASS_SCAP
  * @param[in]  u32KeySize is RSA key size, including:
  *         - \ref RSA_KEY_SIZE_1024
  *         - \ref RSA_KEY_SIZE_2048
  *         - \ref RSA_KEY_SIZE_3072
  *         - \ref RSA_KEY_SIZE_4096
  * @param[in]  psRSA_Buf    The pointer of RSA buffer struct. User should declare correct RSA buffer for specific operation mode first.
  *         - \ref RSA_BUF_NORMAL_T      The struct for normal mode
  *         - \ref RSA_BUF_CRT_T         The struct for CRT ( + CRT bypass) mode
  *         - \ref RSA_BUF_SCAP_T        The struct for SCAP mode
  *         - \ref RSA_BUF_CRT_SCAP_T    The struct for CRT ( + CRT bypass) +SCAP mode
  *         - \ref RSA_BUF_KS_T          The struct for using key store
  * @param[in]  u32BufSize is RSA buffer size.
  * @param[in]  u32UseKS is use key store function.
  *         - \ref RSA_NOT_KS    No use key store function
  *         - \ref RSA_USE_KS    Use key store function
  * @return  0    Success.
  * @return  -1   The value of pointer of RSA buffer struct is NULL.
  */
int32_t RSA_Open(CRYPTO_T *crypto, uint32_t u32OpMode, uint32_t u32KeySize, \
                 const void *psRSA_Buf, uint32_t u32BufSize, uint32_t u32UseKS)
{
    if (psRSA_Buf == (void *)NULL)
    {
        return (-1);
    }

    if (CheckRsaBufferSize(u32OpMode, u32BufSize, u32UseKS) != 0)
    {
        return (-1);
    }

