OpenNuvoton/M55M1BSP/Library/StdDriver/src/crypto.c
    s_u32RsaOpMode = u32OpMode;
    s_u32RSABufAddr = (uintptr_t)psRSA_Buf;
    crypto->RSA_CTL = (u32OpMode) | (u32KeySize << CRYPTO_RSA_CTL_KEYLENG_Pos);
    return 0;
}
/**
  * @brief  Set the RSA key
  * @param[in]  crypto        The pointer of CRYPTO module
  * @param[in]  Key         The private or public key.
  * @return  0    Success.
  * @return  -1   The value of pointer of RSA buffer struct is NULL.
  */
int32_t RSA_SetKey(CRYPTO_T *crypto, char *Key)
{
    if (s_u32RSABufAddr == 0UL)
    {
        return (-1);
    }

    Hex2Reg(Key, RSA_BufWordPtr(offsetof(RSA_BUF_NORMAL_T, au32RsaE)));
    crypto->RSA_SADDR[2] = RSA_BufAddr(offsetof(RSA_BUF_NORMAL_T, au32RsaE)); /* the public key or private key */
    return 0;
}
/**
  * @brief  Set RSA DMA transfer configuration.
  * @param[in]  crypto         The pointer of CRYPTO module
  * @param[in]  Src   RSA DMA source data
  * @param[in]  n     The modulus for both the public and private keys
  * @param[in]  P     The factor of modulus operation(P) for CRT/SCAP mode
  * @param[in]  Q     The factor of modulus operation(Q) for CRT/SCAP mode
  * @return  0    Success.
  * @return  -1   The value of pointer of RSA buffer struct is NULL.
  */
int32_t RSA_SetDMATransfer(CRYPTO_T *crypto, char *Src, char *n, char *P, char *Q)
{
    if (s_u32RSABufAddr == 0UL)
    {
        return (-1);
    }

    Hex2Reg(Src, RSA_BufWordPtr(offsetof(RSA_BUF_NORMAL_T, au32RsaM)));
    Hex2Reg(n, RSA_BufWordPtr(offsetof(RSA_BUF_NORMAL_T, au32RsaN)));
    /* Assign the data to DMA */
    crypto->RSA_SADDR[0] = RSA_BufAddr(offsetof(RSA_BUF_NORMAL_T, au32RsaM)); /* plaintext / encrypt data */
    crypto->RSA_SADDR[1] = RSA_BufAddr(offsetof(RSA_BUF_NORMAL_T, au32RsaN)); /* the base of modulus operation */
    crypto->RSA_DADDR    = RSA_BufAddr(offsetof(RSA_BUF_NORMAL_T, au32RsaOutput)); /* encrypt data / decrypt data */

    if ((s_u32RsaOpMode & CRYPTO_RSA_CTL_CRT_Msk) && (s_u32RsaOpMode & CRYPTO_RSA_CTL_SCAP_Msk))
    {
        /* For RSA CRT/SCAP mode, two primes of private key */
        Hex2Reg(P, RSA_BufWordPtr(offsetof(RSA_BUF_CRT_SCAP_T, au32RsaP)));
        Hex2Reg(Q, RSA_BufWordPtr(offsetof(RSA_BUF_CRT_SCAP_T, au32RsaQ)));
        crypto->RSA_SADDR[3] = RSA_BufAddr(offsetof(RSA_BUF_CRT_SCAP_T, au32RsaP)); /* prime P */
        crypto->RSA_SADDR[4] = RSA_BufAddr(offsetof(RSA_BUF_CRT_SCAP_T, au32RsaQ)); /* prime Q */
        crypto->RSA_MADDR[0] = RSA_BufAddr(offsetof(RSA_BUF_CRT_SCAP_T, au32RsaTmpCp)); /* for storing the intermediate temporary value(Cp) */
        crypto->RSA_MADDR[1] = RSA_BufAddr(offsetof(RSA_BUF_CRT_SCAP_T, au32RsaTmpCq)); /* for storing the intermediate temporary value(Cq) */
        crypto->RSA_MADDR[2] = RSA_BufAddr(offsetof(RSA_BUF_CRT_SCAP_T, au32RsaTmpDp)); /* for storing the intermediate temporary value(Dp) */
        crypto->RSA_MADDR[3] = RSA_BufAddr(offsetof(RSA_BUF_CRT_SCAP_T, au32RsaTmpDq)); /* for storing the intermediate temporary value(Dq) */
        crypto->RSA_MADDR[4] = RSA_BufAddr(offsetof(RSA_BUF_CRT_SCAP_T, au32RsaTmpRp)); /* for storing the intermediate temporary value(Rp) */
        crypto->RSA_MADDR[5] = RSA_BufAddr(offsetof(RSA_BUF_CRT_SCAP_T, au32RsaTmpRq)); /* for storing the intermediate temporary value(Rq) */
        /* For SCAP mode to store the intermediate temporary value(blind key) */
        crypto->RSA_MADDR[6] = RSA_BufAddr(offsetof(RSA_BUF_CRT_SCAP_T, au32RsaTmpBlindKey));
    }
    else if (s_u32RsaOpMode & CRYPTO_RSA_CTL_CRT_Msk)
    {
        /* For RSA CRT/SCAP mode, two primes of private key */
        Hex2Reg(P, RSA_BufWordPtr(offsetof(RSA_BUF_CRT_T, au32RsaP)));
        Hex2Reg(Q, RSA_BufWordPtr(offsetof(RSA_BUF_CRT_T, au32RsaQ)));
        crypto->RSA_SADDR[3] = RSA_BufAddr(offsetof(RSA_BUF_CRT_T, au32RsaP)); /* prime P */
        crypto->RSA_SADDR[4] = RSA_BufAddr(offsetof(RSA_BUF_CRT_T, au32RsaQ)); /* prime Q */
        crypto->RSA_MADDR[0] = RSA_BufAddr(offsetof(RSA_BUF_CRT_T, au32RsaTmpCp)); /* for storing the intermediate temporary value(Cp) */
        crypto->RSA_MADDR[1] = RSA_BufAddr(offsetof(RSA_BUF_CRT_T, au32RsaTmpCq)); /* for storing the intermediate temporary value(Cq) */
        crypto->RSA_MADDR[2] = RSA_BufAddr(offsetof(RSA_BUF_CRT_T, au32RsaTmpDp)); /* for storing the intermediate temporary value(Dp) */
        crypto->RSA_MADDR[3] = RSA_BufAddr(offsetof(RSA_BUF_CRT_T, au32RsaTmpDq)); /* for storing the intermediate temporary value(Dq) */
        crypto->RSA_MADDR[4] = RSA_BufAddr(offsetof(RSA_BUF_CRT_T, au32RsaTmpRp)); /* for storing the intermediate temporary value(Rp) */
        crypto->RSA_MADDR[5] = RSA_BufAddr(offsetof(RSA_BUF_CRT_T, au32RsaTmpRq)); /* for storing the intermediate temporary value(Rq) */
    }
    else if (s_u32RsaOpMode & CRYPTO_RSA_CTL_SCAP_Msk)
    {
        /* For RSA CRT/SCAP mode, two primes of private key */
        Hex2Reg(P, RSA_BufWordPtr(offsetof(RSA_BUF_SCAP_T, au32RsaP)));
        Hex2Reg(Q, RSA_BufWordPtr(offsetof(RSA_BUF_SCAP_T, au32RsaQ)));
        crypto->RSA_SADDR[3] = RSA_BufAddr(offsetof(RSA_BUF_SCAP_T, au32RsaP)); /* prime P */
        crypto->RSA_SADDR[4] = RSA_BufAddr(offsetof(RSA_BUF_SCAP_T, au32RsaQ)); /* prime Q */
        /* For SCAP mode to store the intermediate temporary value(blind key) */
        crypto->RSA_MADDR[6] = RSA_BufAddr(offsetof(RSA_BUF_SCAP_T, au32RsaTmpBlindKey));
    }
    else
    {
        /* No extra DMA buffers are required for normal RSA mode. */
    }

    return 0;
}
/**
  * @brief  Start RSA encrypt/decrypt
  * @param[in]  crypto        The pointer of CRYPTO module
  * @return None
  */
void RSA_Start(CRYPTO_T *crypto)
{
    crypto->RSA_CTL |= CRYPTO_RSA_CTL_START_Msk;
}
/**
  * @brief  Read the RSA output.
  * @param[in]   crypto       The pointer of CRYPTO module
  * @param[out]  Output     The RSA operation output data.
  * @return  0    Success.
  * @return  -1   The value of pointer of RSA buffer struct is NULL.
  */
int32_t RSA_Read(const CRYPTO_T *crypto, char *Output)
{
    if (s_u32RSABufAddr == 0UL)
    {
        return (-1);
    }

