OpenNuvoton/M55M1BSP/Library/StdDriver/src/crypto.c
    const uint32_t au32CntTbl[4] = {256, 512, 768, 1024}; /* count is key length divided by 4 */
    uint32_t u32CntIdx = 0;
    u32CntIdx = (crypto->RSA_CTL & CRYPTO_RSA_CTL_KEYLENG_Msk) >> CRYPTO_RSA_CTL_KEYLENG_Pos;
    Reg2Hex((int32_t)au32CntTbl[u32CntIdx], RSA_BufWordPtr(offsetof(RSA_BUF_NORMAL_T, au32RsaOutput)), Output);
    return 0;
}
/**
  * @brief  Set the RSA key is read from key store
  * @param[in]  crypto           The pointer of CRYPTO module
  * @param[in]  u32KeyNum      The number of private or public key in key store.
  * @param[in]  u32KSMemType   The key is read from selected memory type of key store. It could be:
                            \ref KS_SRAM
                            \ref KS_FLASH
                            \ref KS_OTP
  * @param[in]  u32BlindKeyNum  The number of blind key in SRAM of key store for SCAP mode. This key is un-readable.
  * @return  0    Success.
  * @return  -1   The value of pointer of RSA buffer struct is NULL.
  */
int32_t RSA_SetKey_KS(CRYPTO_T *crypto, uint32_t u32KeyNum, uint32_t u32KSMemType, uint32_t u32BlindKeyNum)
{
    if (s_u32RsaOpMode & CRYPTO_RSA_CTL_SCAP_Msk)
    {
        crypto->RSA_KSCTL = (u32BlindKeyNum << 8) | (u32KSMemType << CRYPTO_RSA_KSCTL_RSSRC_Pos) | CRYPTO_RSA_KSCTL_RSRC_Msk | u32KeyNum;
    }
    else
    {
        crypto->RSA_KSCTL = (u32KSMemType << CRYPTO_RSA_KSCTL_RSSRC_Pos) | CRYPTO_RSA_KSCTL_RSRC_Msk | u32KeyNum;
    }

    return 0;
}
/**
  * @brief  Set RSA DMA transfer configuration while using key store.
  * @param[in]  crypto         The pointer of CRYPTO module
  * @param[in]  Src   RSA DMA source data
  * @param[in]  n     The modulus for both the public and private keys
  * @param[in]  u32PNum         The number of the factor of modulus operation(P) in SRAM of key store for CRT/SCAP mode
  * @param[in]  u32QNum         The number of the factor of modulus operation(Q) in SRAM of key store for CRT/SCAP mode
  * @param[in]  u32CpNum        The number of Cp in SRAM of key store for CRT mode
  * @param[in]  u32CqNum        The number of Cq in SRAM of key store for CRT mode
  * @param[in]  u32DpNum        The number of Dp in SRAM of key store for CRT mode
  * @param[in]  u32DqNum        The number of Dq in SRAM of key store for CRT mode
  * @param[in]  u32RpNum        The number of Rp in SRAM of key store for CRT mode
  * @param[in]  u32RqNum        The number of Rq in SRAM of key store for CRT mode
  * @return  0    Success.
  * @return  -1   The value of pointer of RSA buffer struct is NULL.
  * @note P, Q, Dp, Dq are equal to half key length. Cp, Cq, Rp, Rq, Blind key are equal to key length.
  */
int32_t RSA_SetDMATransfer_KS(CRYPTO_T *crypto, char *Src, char *n, uint32_t u32PNum,
                              uint32_t u32QNum, uint32_t u32CpNum, uint32_t u32CqNum, uint32_t u32DpNum,
                              uint32_t u32DqNum, uint32_t u32RpNum, uint32_t u32RqNum)
{
    if (s_u32RSABufAddr == 0UL)
    {
        return (-1);
    }

    Hex2Reg(Src, RSA_BufWordPtr(offsetof(RSA_BUF_KS_T, au32RsaM)));
    Hex2Reg(n, RSA_BufWordPtr(offsetof(RSA_BUF_KS_T, au32RsaN)));
    /* Assign the data to DMA */
    crypto->RSA_SADDR[0] = RSA_BufAddr(offsetof(RSA_BUF_KS_T, au32RsaM)); /* plaintext / encrypt data */
    crypto->RSA_SADDR[1] = RSA_BufAddr(offsetof(RSA_BUF_KS_T, au32RsaN)); /* the base of modulus operation */
    crypto->RSA_DADDR    = RSA_BufAddr(offsetof(RSA_BUF_KS_T, au32RsaOutput)); /* encrypt data / decrypt data */

    if ((s_u32RsaOpMode & CRYPTO_RSA_CTL_CRT_Msk) || (s_u32RsaOpMode & CRYPTO_RSA_CTL_SCAP_Msk))
    {
        /* For RSA CRT/SCAP mode, two primes of private key */
        crypto->RSA_KSSTS0 = (crypto->RSA_KSSTS0 & (~(CRYPTO_RSA_KSSTS0_NUM0_Msk | CRYPTO_RSA_KSSTS0_NUM1_Msk))) | \
                             (u32PNum << CRYPTO_RSA_KSSTS0_NUM0_Pos) | (u32QNum << CRYPTO_RSA_KSSTS0_NUM1_Pos);
    }

    if (s_u32RsaOpMode & CRYPTO_RSA_CTL_CRT_Msk)
    {
        /* For RSA CRT mode, Cp, Cq, Dp, Dq, Rp, Rq */
        crypto->RSA_KSSTS0 = (crypto->RSA_KSSTS0 & (~(CRYPTO_RSA_KSSTS0_NUM2_Msk | CRYPTO_RSA_KSSTS0_NUM3_Msk))) | \
                             (u32CpNum << CRYPTO_RSA_KSSTS0_NUM2_Pos) | (u32CqNum << CRYPTO_RSA_KSSTS0_NUM3_Pos);
        crypto->RSA_KSSTS1 = (u32DpNum << CRYPTO_RSA_KSSTS1_NUM4_Pos) | (u32DqNum << CRYPTO_RSA_KSSTS1_NUM5_Pos) | \
                             (u32RpNum << CRYPTO_RSA_KSSTS1_NUM6_Pos) | (u32RqNum << CRYPTO_RSA_KSSTS1_NUM7_Pos);
    }

    return 0;
}

/** @} end of group CRYPTO_EXPORTED_FUNCTIONS */
/** @} end of group CRYPTO_Driver */
/** @} end of group Standard_Driver */
